[
    {
        "number": 1,
        "text": "Which scenario best demonstrates Newton's First Law of Motion?",
        "options": {
            "A": "A moving car suddenly brakes, causing passengers to lean forward.",
            "B": "A stationary box starts moving when pushed.",
            "C": "A rocket accelerates upward by expelling gas.",
            "D": "An object slides at constant velocity on a frictionless horizontal surface."
        },
        "correct_answer": "D",
        "explanation": "Newton's First Law states that an object with no net force acting on it will maintain constant velocity (including rest). Option D satisfies this condition. A demonstrates inertia but does not directly describe the law; B and C involve forces changing motion (Second/Third Laws)."
    },
    {
        "number": 2,
        "text": "A 2 kg object accelerates at \\( 3 \\, \\text{m/s}^2 \\). What is the net force acting on it?",
        "options": {
            "A": "1.5N",
            "B": "6N",
            "C": "5N",
            "D": "0.67N"
        },
        "correct_answer": "B",
        "explanation": "By Newton's Second Law: F = ma = 2kg * 3m/s^2 = 6N."
    },
    {
        "number": 3,
        "text": "Which statement about momentum is correct?",
        "options": {
            "A": "Momentum is a scalar.",
            "B": "Momentum conservation applies only to elastic collisions.",
            "C": "If an object’s velocity doubles, its momentum doubles.",
            "D": "Momentum direction aligns with acceleration direction."
        },
        "correct_answer": "C",
        "explanation": "Momentum p = mv. Doubling velocity doubles momentum (C correct). A is false (momentum is a vector); B is false (conserved in all isolated systems); D is false (momentum aligns with velocity, not acceleration)."
    },
    {
        "number": 4,
        "text": "A 5 kg box is pushed 10 m horizontally with an applied force of 20 N against 5 N friction. What is the work done by the applied force?",
        "options": {
            "A": "100 J",
            "B": "200 J",
            "C": "50 J",
            "D": "150 J"
        },
        "correct_answer": "B",
        "explanation": "Work done by the applied force: W = Fd = 20N * 10m= 200J."
    },
    {
        "number": 5,
        "text": "A stone falls freely from 20 m height (air resistance neglected). What is its speed upon impact?",
        "options": {
            "A": "10 m/s",
            "B": "19.8 m/s",
            "C": "30 m/s",
            "D": "40 m/s"
        },
        "correct_answer": "B",
        "explanation": "Using energy conservation: v^2 = u^2 + 2as v^2 = 2 * 9.81 * 20 v = 19.8ms^-1"
    },
    {
        "number": 6,
        "text": "A 0.5 kg ball hits a wall at 10 m/s and rebounds at 8 m/s. What is its momentum change?",
        "options": {
            "A": "1 kg·m/s",
            "B": "9 kg·m/s",
            "C": "18 kg·m/s",
            "D": "-9 kg·m/s"
        },
        "correct_answer": "B",
        "explanation": "Momentum change: p = m(v - u) p = 0.5(-8 - 10) p = -9kg m/s."
    },
    {
        "number": 7,
        "text": "A car travels at a constant 60 km/h. Which statement is true?",
        "options": {
            "A": "Engine force > friction.",
            "B": "Engine force = friction.",
            "C": "Engine force < friction.",
            "D": "The car has negative acceleration."
        },
        "correct_answer": "B",
        "explanation": "Constant velocity implies zero net force. The engine force balances friction."
    },
    {
        "number": 8,
        "text": "According to Boyle’s Law, if a gas is compressed from 4 m³ to 2 m³ in constant temperature, how does its pressure change?*",
        "options": {
            "A": "Halved",
            "B": "Doubled",
            "C": "Unchanged",
            "D": "Quadrupled"
        },
        "correct_answer": "B",
        "explanation": "Boyle’s Law states  P_1 V_1 = P_2 V_2. Halving the volume doubles the pressure."
    },
    {
        "number": 9,
        "text": "A gas in a rigid container has an initial pressure of 100 kPa at 20°C. If the temperature rises to 40°C, what is the new pressure?",
        "options": {
            "A": "93.3 kPa",
            "B": "106.8 kPa",
            "C": "100 kPa",
            "D": "200 kPa"
        },
        "correct_answer": "B",
        "explanation": "Using Charles’s Law P_1 / T_1 =P_2 / T_2 P_2 = P_1 * T_2 / T_1 P_2 = 100kPa * 313 \\ 293 P_2  = 106.8kPa."
    },
    {
        "number": 10,
        "text": "a driver driving at 30m/s on a straight path and he sees a stone 100 m in front of him. To avoid crushing his car, he needs to stop in front of the stone. To note that there is a reaction time of the driver. He stopped his car in front of the stone in 6s after his car started decelerating. What is the magnitude of deceleration of the car and the reaction time respectively?",
        "options": {
            "A": "m/s²,0.66s",
            "B": "m/s²,0.33s",
            "C": "0m/s²,0.66s",
            "D": "0m/s²,0.33s"
        },
        "correct_answer": "",
        "explanation": "From the question,we can know that initial velocity=30m/s,time=6s,final velocity=0. By v=u+at, we can know that the deceleration=5m/s². By v²=u²+2as, we can know that the distance traveled after starting deceleration is 90m. 100-90=10m is the distance traveled in reaction time. 10/30=0.33s"
    },
    {
        "number": 11,
        "text": "Two balls X and Y are 3 kg and 5 kg respectively.  X is moving toward the right to Y with a velocity of 5m/s when Y is remaining at rest. When X and Y collide, Y move towards the right with a velocity of 4m/s. Assume 2 balls are moving on a smooth surface and the total momentum is conserved, what is the velocity of X after colliding?",
        "options": {
            "A": ".67m/s(rightwards)",
            "B": "m/s(rightwards)",
            "C": ".67m/s(leftwards)",
            "D": "m/s(leftwards)"
        },
        "correct_answer": "",
        "explanation": "According to p=mv and conservation of total momentum, 3(5)+5(0)=5(4)+3v         v=-1.67m/s"
    },
    {
        "number": 12,
        "text": "a 5N pushing force is acted on a 2kg block and the block is moving rightward. Assume the block is moving on a smooth surface and there is no other force acting on it. What is the acceleration of the block?",
        "options": {
            "A": ".5m/s²(leftward)",
            "B": "m/s²(rightward)",
            "C": ".5m/s²(rightward)",
            "D": "m/s²(leftward)"
        },
        "correct_answer": "",
        "explanation": "By Fnet=ma, 5=2a,a=2.5. The block is moving rightward and so it gets a 2.5m/s²(rightward) acceleration but not 3m/s² or leftward acceleration."
    },
    {
        "number": 13,
        "text": "Identical blocks X and Y are connected by a string, block X is on the left of block Y and they are placed on a smooth surface. Block X is pulled towards left by a 6N force horizontally while Block Y is pulled towards right by a 10N force horizontally . The string is inextensible. Find the magnitude of the net force acting on block X and Y respectively by considering the system of objects.",
        "options": {
            "A": "an’t determine when mass is not given.",
            "B": "N,3N",
            "C": "N,1N",
            "D": "N,2N"
        },
        "correct_answer": "",
        "explanation": "we can find the net force by using Fnet=ma even if the mass is not given. Let the mass of X and Y be m kg. By considering the system of objects, 10-6=2ma a=2/m. Net force of Y=2/m·m=2N   Net force of X=2/m·m=2N"
    },
    {
        "number": 14,
        "text": "Which of the following can be a unit of work? kgm²/s² J/s J m",
        "options": {
            "A": "1),(4)",
            "B": "1),(3)",
            "C": "2),(3)",
            "D": "ll of the above"
        },
        "correct_answer": "",
        "explanation": "Work done=F·displacement The unit of work is Nm or J By considering Fnet=ma Nm can also express in kgm²/s²"
    },
    {
        "number": 15,
        "text": "Wil and Jeremy are running on the playground. The mass of Jeremy is wil’s times 1.5 and they have the same KE. What is the ratio of the speed of wil to Jeremy?",
        "options": {
            "A": ":√1.5",
            "B": ":1.5",
            "C": ".5:1",
            "D": "1.5:1"
        },
        "correct_answer": "",
        "explanation": "Let wil’s weight be m kg,Jeremy’s be 1.5m kg 0.5mv²=0.5·1.5mu²         v²=1.5u²          v:u=√1.5:1"
    },
    {
        "number": 16,
        "text": "An athlete of mass 65 kg jumps on a trampoline.  A, The lowest position she reached where the trampoline is fully stretched is 30 cm lower than B,  the position when the trampoline is not stretched and her speed upward is 3.5m/s. Find the elastic PE stored in the trampoline when she is at A. Assume the total mechanical energy are conserved.",
        "options": {
            "A": "88J",
            "B": "89J",
            "C": "90J",
            "D": "91J"
        },
        "correct_answer": "",
        "explanation": "when she is at A, the elastic PE is at max, GPE=0,KE=0. When she is at B the elastic PE=0, GPE=65·9.81·0.3, KE= 0.5·65·3.5² Total mechanical energy is conserved, elastic PE at A=65·9.81·0.3+0.5·65·3.5²=589.42》589J"
    },
    {
        "number": 17,
        "text": "A box of mass 15 kg is acted on by a force of 70N. The box is moving with a constant velocity of 5m/s on a rough horizontal surface. If all the applied force suddenly disappeared, what would be the magnitude of the net force on the box?",
        "options": {
            "A": "N",
            "B": "5N",
            "C": "0N",
            "D": "5N"
        },
        "correct_answer": "",
        "explanation": "The box is moving with a constant velocity on a rough surface, which means that Fnet=0, friction applied on the box=70N. When applied force of 70N disappeared , in that instant friction of 70N is acting on the box, so the net force of the box is 70N at that instant."
    },
    {
        "number": 18,
        "text": "The pressure of a fixed volume of an ideal gas is 150kpa and its temperature is 30°C. The gas is then heated to 50°C, what will be the new pressure of the gas?",
        "options": {
            "A": "00kpa",
            "B": "50kpa",
            "C": "59kpa",
            "D": "60kpa"
        },
        "correct_answer": "",
        "explanation": "since P/T=constant,150/(30+273)=p/(50+273) p=159.9》160kpa"
    },
    {
        "number": 19,
        "text": "Which of the following statements are incorrect",
        "options": {
            "A": "ressure is directly proportional to Volume",
            "B": "ressure is directly proportional to Temperature",
            "C": "olume is directly proportional to Temperature",
            "D": "ressure x Volume is directly proportional to Temperature"
        },
        "correct_answer": "",
        "explanation": "it is because pressure against the volume is a curve plotted on the graph."
    },
    {
        "number": 20,
        "text": "What is not a definition of an ideal gas?",
        "options": {
            "A": "ll the molecules are identical and have the same mass.",
            "B": "ntermolecular forces are negligible",
            "C": "he size of each molecule is negligible compared with the separation between them.",
            "D": "ll the molecules are in continuous regular motion."
        },
        "correct_answer": "",
        "explanation": "It is because all the molecules should be in continuous random motion for ideal gas."
    },
    {
        "number": 21,
        "text": "Mr. Hung finds out that the meat balls get BIGGER when he puts them in the hotpot. Suppose the meatball at 0 degree can trap 1cm3 of air and no air is leaked when heated. Besides, the pressure is also unchanged.What is the volume of the air when it is heated to 100degree.",
        "options": {
            "A": ".29cm3",
            "B": ".37cm3",
            "C": ".42cm3",
            "D": ".48cm3"
        },
        "correct_answer": "",
        "explanation": "By using Charles's Law, which states that the volume of a gas is directly proportional to its temperature when pressure is held constant,we can find the V1/T1 =V2/T2"
    },
    {
        "number": 22,
        "text": "Which scenario demonstrates the concept of work done on an object?",
        "options": {
            "A": "ushing an extreme heavy object on rough surface",
            "B": "olding a box stationary",
            "C": "ushing a box on a frictionless surface",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "Work is the energy transferred due to the action of force over a displacement, as in lifting or pushing the box. Holding the box stationary (B) or (A) involves no displacement, so no work is done."
    },
    {
        "number": 23,
        "text": "If two objects collide elastically, which of the following statements is true?",
        "options": {
            "A": "inetic energy is lost",
            "B": "nly momentum is conserved",
            "C": "otal momentum before collision equals total momentum after collision",
            "D": "otential energy is converted to kinetic energy"
        },
        "correct_answer": "C",
        "explanation": "In elastic collisions, both momentum and kinetic energy are conserved. A is incorrect because kinetic energy is not lost; B is wrong as kinetic energy is also conserved, and D misrepresents energy conversion in elastic collisions."
    },
    {
        "number": 24,
        "text": "When an explosion occurs, 2 objects with different directions and masses fly away. In this situation,which of the following sum is 0?",
        "options": {
            "A": "omentum",
            "B": "elocity",
            "C": "inetic energy",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "During explosion only momentum is conserved and at the beginning  the momentum is 0, showing that after explosion the momentum is also 0."
    },
    {
        "number": 25,
        "text": "In an inelastic collision, what happens to the momentum of the system?",
        "options": {
            "A": "It is conserved",
            "B": "It increases",
            "C": "t decreases",
            "D": "t transforms into potential energy"
        },
        "correct_answer": "",
        "explanation": "In inelastic collisions,momentum is transferred also. B and C are incorrect as momentum will not be lost and D misrepresents energy transformation."
    },
    {
        "number": 26,
        "text": "In an isolated system, what MUST BE TRUE about the total energy?",
        "options": {
            "A": "t can change forms but remains constant",
            "B": "It can be created or destroyed",
            "C": "t is always increasing",
            "D": "t is dependent on external forces"
        },
        "correct_answer": "",
        "explanation": "The law of conservation of energy states that energy cannot be created or destroyed but can transform from one form to another. B is incorrect as energy cannot be created or destroyed; C is wrong because total energy does not inherently increase, and D is incorrect as external forces do not affect total energy in an isolated system."
    },
    {
        "number": 27,
        "text": "A sample of gas occupies a volume of 1.47m3 at a pressure of 200 kPa and a temperature of 25 degree. What is the total KE of the gas molecules?",
        "options": {
            "A": "67000J",
            "B": "89000J",
            "C": "13000J",
            "D": "41000J"
        },
        "correct_answer": "",
        "explanation": "Using The gas law we find the no. of mole is 118.72with n=PV/RT and use second law KE=3/2nRT getting 441000J"
    },
    {
        "number": 28,
        "text": "According to Newton’s law of motion, if a stone in space is thrown out at the velocity of 20 ms^-1, what is its speed when 1000 thousand years have passed?",
        "options": {
            "A": "0 m/min",
            "B": ".2 km/s",
            "C": "000 km/s",
            "D": "2 km/h"
        },
        "correct_answer": "",
        "explanation": "Anyone who gets this question wrong has not attended a single lesson."
    },
    {
        "number": 29,
        "text": "Crane A is lifting a 10 kg load by 10m with constant velocity. What is the gain in potential energy?",
        "options": {
            "A": "00J",
            "B": "81J",
            "C": ".81J/s",
            "D": "81W"
        },
        "correct_answer": "",
        "explanation": "gain in P.E.= (change in height)*(acceleration due to gravity)*(mass)"
    },
    {
        "number": 30,
        "text": "Crane B lifted the same load along a frictionless slope in the same amount of time with constant velocity. Which of the following is correct?",
        "options": {
            "A": "rane B does more work than Crane A",
            "B": "rane A has a higher power than Crane B",
            "C": "he distance travelled by the load lifted by Crane B is longer than that lifted by Crane A",
            "D": "he vertical displacement travelled by the load lifted by Crane B is longer than that lifted by Crane A"
        },
        "correct_answer": "",
        "explanation": "By pythagoras' theorem, the length of the hypotenuse must be longer than the other two sides."
    },
    {
        "number": 31,
        "text": "What if the slope is not frictionless? Which of the following is correct?",
        "options": {
            "A": "rane B does more work than Crane A",
            "B": "rane A has a higher power than Crane B",
            "C": "he work done against friction by Crane B is the same as the gain in potential energy by the load",
            "D": "he vertical displacement travelled by the load lifted by Crane B is longer than that lifted by Crane A"
        },
        "correct_answer": "A",
        "explanation": "A larger force is needed to overcome the friction. So with a large force by W=fs, given the same s, W is larger."
    },
    {
        "number": 32,
        "text": "Which of the following regarding the kinetic gas theory and general gas law is correct?",
        "options": {
            "A": "hen the volume of the container decreases, the gas molecules collide with the walls of the container more violently",
            "B": "he total kinetic energy of the particles must increase when the temperature increases even when other factors are also changed.",
            "C": "he momentum change of the gas particles when they collide with the walls of the container explains gas pressure",
            "D": "he general gas law can accurately describe nitrogen gas at -196˚C"
        },
        "correct_answer": "C",
        "explanation": "Pressure=Force/Area Force is required to cause change of momentum. So the change in momentum of the gas particles when colliding with the walls of the container creates gas pressure"
    },
    {
        "number": 33,
        "text": "A block slides down from a slope 10 m high and hits another block of the same mass at the end of the slope. The collision is completely inelastic. The blocks travel up another slope of the height of 2m. What is the loss of energy? Express the answer in terms of m, the mass of one block.",
        "options": {
            "A": "0m",
            "B": "9.9m",
            "C": "8.48m",
            "D": "8.86m"
        },
        "correct_answer": "",
        "explanation": "P.E. at the start- P.E. at the end"
    },
    {
        "number": 34,
        "text": "Which of the following is correct?",
        "options": {
            "A": "he mass of the block in a lift decelerating downwards decreases",
            "B": "he apparent weight of the block in a lift accelerating upwards increases",
            "C": "he apparent weight of the bock in a lift decelerating upwards increases",
            "D": "he mass of the block in a lift moving at constant velocity decreases"
        },
        "correct_answer": "B",
        "explanation": "Apparent weight is the normal reaction force exerted by the floor on the person. When the lift is accelerating upwards, the man is also accelerating upwards so an upward force provided by the floor is needed."
    },
    {
        "number": 35,
        "text": "A space battleship fires a cannon ball of 10 kg with its railgun pointing forward at a velocity of 11.2 km/s. What is the exhaust velocity of gas ejected out of the thrusters at the back in order to keep the space battleship stationary if the mass of gas ejected is 1.34 kg?",
        "options": {
            "A": "35 km/s",
            "B": "8360 m/s",
            "C": "3.6 m/s",
            "D": "3.6 km/s"
        },
        "correct_answer": "D",
        "explanation": "v= 11.2*1000*10/1.34 m/s"
    },
    {
        "number": 36,
        "text": "Freedom Gundam fires its thrusters for 1 second to evade a missile from the enemy. When it fires its thrusters, the body of it is perpendicular to horizontal. The thruster at its back makes a 30˚ angle to its body. The mass of Freedom Gundam is 71500 kg and 5 kg of gas is ejected out of the engine at 20 km/s. What is the change in vertical velocity? Assume it is not affected by any gravitational fields.",
        "options": {
            "A": ".4 m/s",
            "B": ".699 m/s",
            "C": ".21 m/s",
            "D": "60 m/s"
        },
        "correct_answer": "C",
        "explanation": "∆V = ((20000*5)/71500)*cos30˚"
    },
    {
        "number": 37,
        "text": "A car weighted 500N travelling with a speed of 20m/s on a highway and crashed to a bus weighted 1000N that was stopped beside the road.Neglecting the friction of the bus then moved 10 metres after a second, what is the velocity when the car hit the bus?",
        "options": {
            "A": "m/s",
            "B": "0m/s",
            "C": ".67m/s",
            "D": "m/s"
        },
        "correct_answer": "",
        "explanation": "Conservation of momentum"
    },
    {
        "number": 38,
        "text": "A car was travelling at 10m/s, the driver saw a dog on the road and applied the brake with in 0.394s, the car finally came to a stop after 10s, what is the acceleration of the car?",
        "options": {
            "A": "",
            "B": "2",
            "C": "9.27",
            "D": ".27"
        },
        "correct_answer": "",
        "explanation": "reaction time is included in the total time"
    },
    {
        "number": 39,
        "text": "A car weighted 500N travelling with a speed of 20m/s on a highway and crashed to a bus weighted 1000N that was stopped beside the road.Neglecting the friction of the bus then moved 10 metres after a second, what is the velocity when the car hit the bus?",
        "options": {
            "A": "m/s",
            "B": "0m/s",
            "C": ".67m/s",
            "D": "m/s"
        },
        "correct_answer": "",
        "explanation": "Conservation of momentum"
    },
    {
        "number": 40,
        "text": "A car was travelling at 10m/s, the driver saw a dog on the road and applied the brake with in 0.394s, the car finally came to a stop after 10s, what is the acceleration of the car?",
        "options": {
            "A": "",
            "B": "2",
            "C": "9.27",
            "D": ".27"
        },
        "correct_answer": "",
        "explanation": "reaction time is included in the total time"
    },
    {
        "number": 41,
        "text": "A 2 kg ball is thrown upwards with an initial velocity of 20 m/s from ground level. What is the total energy of the system when the ball reaches its maximum height?",
        "options": {
            "A": "0J",
            "B": "0J",
            "C": "00J",
            "D": "00J"
        },
        "correct_answer": "",
        "explanation": "KE =½ x2 x10^2 =100"
    },
    {
        "number": 42,
        "text": "A 5 kg object is initially at rest on the ground. It is then lifted vertically to a height of 20 meters and acquires a velocity of 3 m/s at that position. What is the change in the object's total mechanical energy during this process?",
        "options": {
            "A": "4.5J",
            "B": "04.5J",
            "C": "004.5J",
            "D": "81J"
        },
        "correct_answer": "",
        "explanation": "981+22.5=1,003.5J"
    },
    {
        "number": 43,
        "text": "A book rests on a table. Which of the following statements correctly describes an action-reaction pair involving the book?",
        "options": {
            "A": "The Earth’s gravity pulls the book downward , and the table pushes the book upward",
            "B": "he book exerts a downward force on the table, and the table exerts an upward force on the book",
            "C": "he book pushes the table , and air resistance pushes back on the book",
            "D": "he table supports the book , and the book’s mass creates friction"
        },
        "correct_answer": "B",
        "explanation": "A:The reaction to Earth’s gravity is the book pulling up on the Earth, not the table’s normal force. C:Air resistance is unrelated to the book-table interaction D:The table’s force and friction are unrelated Third Law pairs."
    },
    {
        "number": 44,
        "text": "A rubber ball strikes a wall and bounces back. Which of the following statements is/are correct?",
        "options": {
            "A": "The total momentum of the ball and the wall is conserved.",
            "B": "The momentum of the ball is conserved.",
            "C": "The momentum of the wall is conserved.",
            "D": "None of the above."
        },
        "correct_answer": "A",
        "explanation": "A:Momentum is always conserved in a system if no external forces act. The ball-wall system is isolated during the collision, so their total momentum remains unchanged"
    },
    {
        "number": 45,
        "text": "A uniform 4-meter-long beam of negligible weight is balanced at its pivot. A 6 kg mass is placed 1 meter to the left of the pivot. What mass must be placed 2 meters to the right of the pivot to keep the beam in equilibrium?",
        "options": {
            "A": "1.5 kg",
            "B": "3 kg",
            "C": "4.5 kg",
            "D": "6 kg"
        },
        "correct_answer": "",
        "explanation": "6× 9.81 × 1 = Mass × 2 × 9.81"
    },
    {
        "number": 46,
        "text": "A motorcyclist traveling at 90 km/h on a straight road suddenly notices a traffic signal 75 meters ahead turning red. If the rider's reaction time is 0.4 seconds, what is the minimum deceleration required to stop safely before the signal?",
        "options": {
            "A": "3.15 m s⁻²",
            "B": "3.82 m s⁻²",
            "C": "4.25 m s⁻²",
            "D": "4.81 m s⁻²"
        },
        "correct_answer": "D",
        "explanation": "90km/h=  25m/s 25* 0.4 =10m      75-10=65m 0=25^2 + 2a(65),    a= -4.81m s⁻²"
    },
    {
        "number": 47,
        "text": "Car A is in front of Car B 100m. Car A is in constant velocity of 7ms-1 while Car B is accelerating constantly at 9ms-2 from rest. In which distance from starting point of Car B will they meet?",
        "options": {
            "A": "38.9m",
            "B": "70.1m",
            "C": "98.9m",
            "D": "30.1m"
        },
        "correct_answer": "",
        "explanation": "s=ut+1/2at2 7t+100= 9/2t2 s=7t+100"
    },
    {
        "number": 48,
        "text": "Refer to fig 1. What is the friction acting on A by B, and B by A respectively?",
        "options": {
            "A": ";0",
            "B": ";5",
            "C": ";6",
            "D": ";6"
        },
        "correct_answer": "D",
        "explanation": "The only force acting on block A is friction. F=ma=2x3=6. As the opposite frictional forces are action reaction pairs, the friction on B by A is also 6."
    },
    {
        "number": 49,
        "text": "Trolley A accelerates to right and crashes on Trolly B which has a constant velocity to right. They then stick together and move to the right with the same speed. What kind of collision is it?",
        "options": {
            "A": "ompletely inelastic collision",
            "B": "nelastic collision",
            "C": "lastic collision",
            "D": "xplosion"
        },
        "correct_answer": "B",
        "explanation": "they have the same direction ."
    },
    {
        "number": 50,
        "text": "which is/are the equation(s) of the total kinetic energy of a gas? 1)1/2Nmc2 2) 3/2 PV 3) 3/2 nRT",
        "options": {
            "A": ",3",
            "B": ",2",
            "C": ",3",
            "D": ",2,3"
        },
        "correct_answer": "",
        "explanation": "total kinetic energy =3/2nRT= 1/2Nmc2, and PV=nRT so 2 is also correct"
    },
    {
        "number": 51,
        "text": "The pressure and temperature of a gas is 110 kpa and 2C respectively. When it is heated, the temperature becomes 7C while the pressure do not change. What does the volume change?",
        "options": {
            "A": "ncrease",
            "B": "ecrease",
            "C": "nchanged",
            "D": "an not be determined"
        },
        "correct_answer": "",
        "explanation": "PV/T= constant. When T increases, V increases."
    },
    {
        "number": 52,
        "text": "when pressure of a gas decreases, which of the following is incorrect? 1.Total kinetic energy conserved 2.R increases constantly 3.temperature decreases",
        "options": {
            "A": ",2",
            "B": ",3",
            "C": ",3",
            "D": ",2,3"
        },
        "correct_answer": "",
        "explanation": "KE increases, while R is a constant. Temperature will decrease."
    },
    {
        "number": 53,
        "text": "There is a hot air balloon. It has a fixed volume of 500m3. The temperature before and after it rises are 25C and 60C respectively. The pressure before and after it rises are 50kPa and 46kPa respectively. Find the number of molecules before and after it rises.",
        "options": {
            "A": "075;0 moles",
            "B": "0095;2330 moles",
            "C": "075;2730 moles",
            "D": "0095;8312 moles"
        },
        "correct_answer": "D",
        "explanation": "PV= nRT (500)(50000)=n8.31(298) (500)(46000)=n(8.31)(333)"
    },
    {
        "number": 54,
        "text": "It is known that the mass of Mars is about 1/10 of that of the Earth while its radius is about 1/2 of the Earth’s radius. In terms of gravitational acceleration g on Earth’s surface, the approximate gravitational acceleration on the surface of Mars is",
        "options": {
            "A": "0.2g",
            "B": "0.4g",
            "C": "2.5g",
            "D": "4g"
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 55,
        "text": "An object is projected vertically upwards. F denotes the magnitude of the net force acting on the object and W denotes the magnitude of the weight of the object. If air resistance is not negligible, which of the following descriptions are correct ? (1) When the object is moving up, F is greater than W. (2) When the object is at the highest point, F is equal to W. (3) When the object is moving down, F is smaller than W.",
        "options": {
            "A": "(1) and (2) only",
            "B": "(1) and (3) only",
            "C": "(2) and (3) only",
            "D": "(1),(2) and (3)"
        },
        "correct_answer": "D",
        "explanation": ""
    },
    {
        "number": 56,
        "text": "An object of mass 0.5 kg is raised vertically from the ground by a motor. The object is raised 2.5 m in 1.5 s with uniform speed. Estimate the output power of the motor.",
        "options": {
            "A": "5.5 W",
            "B": "8.2 W",
            "C": "11.0 W",
            "D": "16.4 W"
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 57,
        "text": "An astronaut inside a spacecraft moving in a circular orbit around the Earth is apparently weightless because",
        "options": {
            "A": "the astronaut is too far from the Earth to feel the Earth’s gravitational force.",
            "B": "the astronaut and the spacecraft are both moving with the same acceleration towards the Earth",
            "C": "the Earth’s gravitational force on the astronaut is balanced by the reaction force of the spacecraft’s floor.",
            "D": "the Earth’s gravitational force on the astronaut is balanced by the centripetal force."
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 58,
        "text": "Match each observation (1–3) to the correct gas law (A–C): 1.When cooled, the gas volume decreases at constant pressure. 2.When heated, the gas pressure increases at constant volume. 3.When compressed, the gas pressure increases at constant temperature.",
        "options": {
            "A": "1:a  2:b  3:c",
            "B": "1:b  2:c  3:a",
            "C": "1:c  2:a  3:b",
            "D": "1:b  2:a  3:c"
        },
        "correct_answer": "B",
        "explanation": "1. Volume decreases when cooled (constant P) 2.Pressure increases when heated (constant V) 3.Pressure increases when compressed (constant T)"
    },
    {
        "number": 59,
        "text": "Which one is correct when a fixed mass of gas is compressed and also heated at the same time? 1.Average spacing between the gas molecules 2.Average speed of the gas  molecules",
        "options": {
            "A": "1.remains unchanged 2.increases",
            "B": "1.decreases 2.increases",
            "C": "1.decreases 2.decreases",
            "D": "1.decreases 2.remains unchanged"
        },
        "correct_answer": "B",
        "explanation": "it is because the gas molecules will go faster when the temperature is higher"
    },
    {
        "number": 60,
        "text": "According to the kinetic theory of gases, which of the following statements is incorrect for an ideal gas?",
        "options": {
            "A": "The pressure exerted by the gas arises due to collisions of molecules with the container walls",
            "B": "The average kinetic energy of the gas molecules is directly proportional to the absolute temperature",
            "C": "Gas molecules exert strong intermolecular forces on each other except during collisions",
            "D": "The r.m.s. speed of the gas molecules depends on both the temperature and the molar mass of the gas"
        },
        "correct_answer": "C",
        "explanation": "It is because ideal gas molecules exert no intermolecular forces"
    },
    {
        "number": 61,
        "text": "An ideal gas is heated at constant volume. Which of the following quantities must increase?",
        "options": {
            "A": "Root-mean-square (r.m.s.) speed of molecules",
            "B": "Potential energy of the gas",
            "C": "Average intermolecular distance",
            "D": "Number of molecules per unit volume"
        },
        "correct_answer": "A",
        "explanation": "The r.m.s. speed of molecules depends on temperature which increases when heated"
    },
    {
        "number": 62,
        "text": "When you heat an ideal gas, what happens to its molecules?",
        "options": {
            "A": "Move faster",
            "B": "Move slower",
            "C": "Become heavier",
            "D": "Become Lighter"
        },
        "correct_answer": "A",
        "explanation": "Gas molecules move faster when the temperature is higher"
    },
    {
        "number": 63,
        "text": "Two ideal gas samples in identical containers are at the same temperature but have different molecular masses. Which statement is correct?",
        "options": {
            "A": "Both samples exert equal pressure on their containers",
            "B": "The lighter molecules collide with the container walls more frequently",
            "C": "Both samples have molecules with the same average speed",
            "D": "The heavier molecules have greater average kinetic energy"
        },
        "correct_answer": "B",
        "explanation": "Lighter molecules move faster so there will be more frequent wall collisions"
    },
    {
        "number": 64,
        "text": "Which of the following items can reduce the impact force during a car crash?",
        "options": {
            "A": "The Bumper",
            "B": "The Seat Belt",
            "C": "The Air Bag",
            "D": "All of the above"
        },
        "correct_answer": "D",
        "explanation": "All of the items above can prolong the impact time of our body with the car."
    },
    {
        "number": 65,
        "text": "Which of the following is not a vector quantity?",
        "options": {
            "A": "Acceleration",
            "B": "Distance",
            "C": "Displacement",
            "D": "Velocity"
        },
        "correct_answer": "B",
        "explanation": "Only distance doesn’t need to account for its direction."
    },
    {
        "number": 66,
        "text": "Which of the following statements about an object momentarily at rest is/are incorrect?",
        "options": {
            "A": "The speed of the object is zero",
            "B": "The net force acting on the object is zero",
            "C": "A force is required to change the speed of the object",
            "D": "None are incorrect"
        },
        "correct_answer": "B",
        "explanation": "When an object is momentarily at rest, gravity is still acting on the object."
    },
    {
        "number": 67,
        "text": "According to Newton’s Second Law of Motion, what is relationship between force, mass and acceleration?",
        "options": {
            "A": "Force equals mass divided by acceleration",
            "B": "Force equals acceleration divided by mass",
            "C": "Force is not affected by mass or acceleration",
            "D": "Force equals mass times acceleration"
        },
        "correct_answer": "D",
        "explanation": "F=ma"
    },
    {
        "number": 68,
        "text": "Which of the following best represents Newton’s Third Law of Motion?",
        "options": {
            "A": "A ball rolling down the hill due to gravity",
            "B": "A car accelerates when the gas pedal is pressed",
            "C": "A person pushes a wall and feels some force pushing back",
            "D": "A rocket coming back to earth using gravity"
        },
        "correct_answer": "C",
        "explanation": "An action has a reaction force"
    },
    {
        "number": 69,
        "text": "What is the formula for calculating speed?",
        "options": {
            "A": "Speed = Distance × Time",
            "B": "Speed = Distance / Time",
            "C": "Speed = Time / Distance",
            "D": "Speed = Distance + Time"
        },
        "correct_answer": "B",
        "explanation": "Speed tells us how fast something is moving, calculated by dividing the distance traveled by the time taken."
    },
    {
        "number": 70,
        "text": "If a car travels 100 meters in 5 seconds, what is its speed?",
        "options": {
            "A": "10 m/s",
            "B": "15 m/s",
            "C": "20 m/s",
            "D": "25 m/s"
        },
        "correct_answer": "C",
        "explanation": "Speed is calculated by dividing 100 meters by 5 seconds, resulting in 20 meters per second."
    },
    {
        "number": 71,
        "text": "What is the difference between speed and velocity?",
        "options": {
            "A": "Speed is faster than velocity.",
            "B": "Speed is a vector; velocity is a scalar.",
            "C": "Speed is a scalar; velocity is a vector.",
            "D": "There is no difference."
        },
        "correct_answer": "C",
        "explanation": "Speed has magnitude only, while velocity includes both magnitude and direction."
    },
    {
        "number": 72,
        "text": "What is Newton's first law of motion?",
        "options": {
            "A": "Force equals mass times acceleration.",
            "B": "For every action, there is an equal and opposite reaction.",
            "C": "An object in motion stays in motion unless acted upon.",
            "D": "Energy cannot be created or destroyed."
        },
        "correct_answer": "C",
        "explanation": "This law states that objects will not change their state of motion unless a force acts on them."
    },
    {
        "number": 73,
        "text": "If a ball is thrown upwards, what happens to its velocity as it rises?",
        "options": {
            "A": "It increases.",
            "B": "It decreases.",
            "C": "It stays the same.",
            "D": "It becomes negative."
        },
        "correct_answer": "B",
        "explanation": "As the ball rises, gravity slows it down until it stops at the highest point."
    },
    {
        "number": 74,
        "text": "What is the unit of force in the International System of Units ?",
        "options": {
            "A": "Joule",
            "B": "Newton",
            "C": "Pascal",
            "D": "Watt"
        },
        "correct_answer": "B",
        "explanation": "The Newton (N) is the standard unit for measuring force."
    },
    {
        "number": 75,
        "text": "What is the freezing point of water in degrees Celsius?",
        "options": {
            "A": "-10°C",
            "B": "0°C",
            "C": "10°C",
            "D": "100°C"
        },
        "correct_answer": "B",
        "explanation": "Water freezes at 0 degrees Celsius, the temperature at which it changes from liquid to solid."
    },
    {
        "number": 76,
        "text": "What instrument is used to measure temperature?",
        "options": {
            "A": "Barometer",
            "B": "Anemometer",
            "C": "Thermometer",
            "D": "Hygrometer"
        },
        "correct_answer": "C",
        "explanation": "A thermometer is designed to measure temperature, using liquid or digital sensors."
    },
    {
        "number": 77,
        "text": "At what temperature does water boil in degrees Celsius?",
        "options": {
            "A": "90°C",
            "B": "100°C",
            "C": "110°C",
            "D": "120°C"
        },
        "correct_answer": "B",
        "explanation": "Water boils at 100 degrees Celsius, changing from liquid to gas ."
    },
    {
        "number": 78,
        "text": "What happens to the molecules of a substance as its temperature increases?",
        "options": {
            "A": "They move slower.",
            "B": "They move faster and spread apart.",
            "C": "They stay still.",
            "D": "They become heavier."
        },
        "correct_answer": "B",
        "explanation": "As temperature rises, molecules gain energy, moving faster and spreading apart."
    },
    {
        "number": 79,
        "text": "According to Newton's First Law of Motion, an object at rest will stay at rest and an object in motion will stay in motion with the same velocity unless acted upon by:",
        "options": {
            "A": "gravity",
            "B": "friction",
            "C": "an unbalanced force",
            "D": "air resistance"
        },
        "correct_answer": "C",
        "explanation": "Object's state of motion will remain constant unless a net or unbalanced force acts upon it."
    },
    {
        "number": 80,
        "text": "Which of the following is a vector?",
        "options": {
            "A": "speed",
            "B": "distance",
            "C": "velocity",
            "D": "mass"
        },
        "correct_answer": "C",
        "explanation": "Velocity has direction."
    },
    {
        "number": 81,
        "text": "Two objects have masses m1​ and m2​, where m1​>m2​. If the same force is applied to both objects, which object will experience a greater acceleration?",
        "options": {
            "A": "The object with mass m1​",
            "B": "The object with mass m2",
            "C": "Same",
            "D": "It depends on the shape of the objects"
        },
        "correct_answer": "B",
        "explanation": "The object with the smaller mass (m2​) will experience a greater acceleration for the same applied force."
    },
    {
        "number": 82,
        "text": "The force that opposes the motion of an object moving through a fluid (like air or water) is called:",
        "options": {
            "A": "gravity",
            "B": "normal force",
            "C": "friction",
            "D": "drag force"
        },
        "correct_answer": "D",
        "explanation": "Drag force is a type of friction that acts on objects moving through fluids."
    },
    {
        "number": 83,
        "text": "Which of the following scenarios demonstrates Newton's Third Law of Motion?",
        "options": {
            "A": "A car accelerates when the driver presses the gas pedal",
            "B": "A book rests on a table, and the table exerts an upward force on the book",
            "C": "A ball rolling on a flat surface eventually comes to a stop due to friction",
            "D": "A rocket propels forward by expelling hot gases out of its back"
        },
        "correct_answer": "D",
        "explanation": "Action reaction pair."
    },
    {
        "number": 84,
        "text": "If the velocity of an object is doubled, what happens to the kinetic energy?",
        "options": {
            "A": "It reduces by half",
            "B": "It remains the same",
            "C": "It doubles",
            "D": "It quadruples"
        },
        "correct_answer": "D",
        "explanation": "KE=0.5mv2 4KE=0.5m(2v)2"
    },
    {
        "number": 85,
        "text": "Which of the following statement(s) must be correct? 1) A ball rolled on a smooth surface will not stop and will keep rolling forever. 2) Two objects with the same mass fall with the same acceleration 3) A gun recoils when a bullet is fired",
        "options": {
            "A": "(3) only",
            "B": "(1) and (2) only",
            "C": "(2) and (3) only",
            "D": "(1) ,(2) and (3)"
        },
        "correct_answer": "A",
        "explanation": "is incorrect because there is air resistance and the ball will eventually stop. is incorrect because two objects may have different surface areas. is correct because of Newton’s third law."
    },
    {
        "number": 86,
        "text": "Peter uses his hand to throw a ball vertically upwards with an initial speed of 6ms-1. What is the distance between the highest point the ball reaches and Peter’s hand?",
        "options": {
            "A": "1.22m",
            "B": "1.83m",
            "C": "2.45m",
            "D": "3.67m"
        },
        "correct_answer": "B",
        "explanation": "KE=PE 0.5(m)(6)2=m(9.81)(h) h=1.83m"
    },
    {
        "number": 87,
        "text": "Ball X is of the same size as ball Y but is much heavier. They are released from rest at the same time from a certain height. Which of the following statements about the balls is/are correct? (1) X reaches the ground before Y. (2) The velocity of each ball increases uniformly. (3) Their accelerations are zero when they are just released.",
        "options": {
            "A": "(1)only",
            "B": "1) and (2) only",
            "C": "2) only",
            "D": "1) and (3) only"
        },
        "correct_answer": "C",
        "explanation": "Y should reaches ground before x, acceleration =9.81"
    },
    {
        "number": 88,
        "text": "Which of the following statements about force is incorrect?",
        "options": {
            "A": "orce is a vector quantity",
            "B": "orces always exist in pairs",
            "C": "n object can exert a force on another object only id the two objects are incontact",
            "D": "he unit of force is newton"
        },
        "correct_answer": "C",
        "explanation": "There’s non contact force"
    },
    {
        "number": 89,
        "text": "Which of the following statements is/are correct? (1) When moving at the same speed, a bowling ball is harder to stop than a ping-pong ball. (2) Objects always have the same inertia when they are at rest. (3) When a bus accelerates forwards suddenly, passengers inside lean backwards because they are acted on by friction.",
        "options": {
            "A": "(1) only",
            "B": "(2) and (3) only",
            "C": "3) only",
            "D": "1),(2) and (3)"
        },
        "correct_answer": "",
        "explanation": ""
    },
    {
        "number": 90,
        "text": "Assume that the ball slows down uniformly. If the velocity of the ball after being kicked is u m s what is the net force acting on the ball when it rolls. A boy kicks a ball of mass 1.2 kg on level grassland. The ball rolls for 20 m before it stops.",
        "options": {
            "A": "0.01 u2 N",
            "B": ".02 u2 N",
            "C": ".03 u2 N",
            "D": ""
        },
        "correct_answer": "",
        "explanation": "by v2=u2 + 2as, a= u/40. By F=ma, F= 1.2u/40=0.03"
    },
    {
        "number": 91,
        "text": "Two objects fall freely from the same position in a vacuum. Which of the following statements must be correct? (1) The objects have the same acceleration. (2) The net forces acting on the objects are always the same. (3) The net force acting on each object keeps decreasing.",
        "options": {
            "A": "2) only",
            "B": "1), (2) only",
            "C": "2), (3) only",
            "D": "1),(2) and (3)"
        },
        "correct_answer": "",
        "explanation": "By F=ma, the net force will be affected by the mass of the object;no air resistance in the vacuum"
    },
    {
        "number": 92,
        "text": "Which of the following is/are the direct implication(s) of inertia? (1) A boy standing on a bus is 'pulled' backwards when the bus starts moving. (2) If you push another person in front of you on a smooth surface, you will move backwards. (3) The balls of different masses reach the ground at the same time in Galileo's experiment (carried out on the tower of Pisa).",
        "options": {
            "A": "1) only",
            "B": "2) only",
            "C": "3) only",
            "D": "1) and (2) only"
        },
        "correct_answer": "",
        "explanation": ""
    },
    {
        "number": 93,
        "text": "Which of the following statements is/are correct? (1) Absolute zero is equal to 0 °C. (2) The difference between the steam point and the ice point is 100 K. (3) The steam point is equal to 373 K.",
        "options": {
            "A": "1) only",
            "B": "2) only",
            "C": "2) and (3) only",
            "D": "1), (2) and (3)"
        },
        "correct_answer": "",
        "explanation": "Absolute zero =-273.15 degree Celsius,which is 0k; steam point and ice point is having 100 degree Celsius as the difference between them"
    },
    {
        "number": 94,
        "text": "Which of the following is not an assumption made about an ideal gas in the kinetic theory?",
        "options": {
            "A": "olecules are in random motion.",
            "B": "ll collisions are perfectly elastic.",
            "C": "he speeds of all molecules are the same at a given temperature.",
            "D": "ntermolecular forces are negligible."
        },
        "correct_answer": "",
        "explanation": ""
    },
    {
        "number": 95,
        "text": "An object falls from point P to Q. Air resistance increase with the speed of the object (1) The net force acting on the object throughout the motion is constant (2) The magnitude of acceleration decreased to zero when the object reaches Q (3) The KE gained by the object from P to Q is equal to the loss of the GPE",
        "options": {
            "A": "(1)",
            "B": "(2)",
            "C": "(3)",
            "D": "(2) and (3)"
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 96,
        "text": "200 J 50 J 20 J 8 J A block is pulled along a horizontal bench at a constant velocity of 10m/s by a force of 5 N. What is the work done against friction in 5 seconds?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "A",
        "explanation": "5*40=200"
    },
    {
        "number": 97,
        "text": "An ideal gas of mass 100 g is stored in a rigid container. Suppose its molecules have a root-mean-square speed of 200 m s' when the gas pressure is 300 kPa, what is the volume of the container?",
        "options": {
            "A": ".22x10^-5 m^3",
            "B": ".44x10^-3 m^3",
            "C": ".66x10^-3 m^3",
            "D": ".33×10^-2 m^3"
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 98,
        "text": "final speed:5m/s distance:25m final speed:5m/s distance:50m final speed:10m/s distance:25m final speed:10m/s distance:50m A car speeds up from rest at a uniform acceleration of 2 m^-2 for 5 seconds. What is the final speed and distance travelled by the car?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "C",
        "explanation": "0+2*5=10m/s ((5)^2*2)/2=25m"
    },
    {
        "number": 99,
        "text": "24m 54.5m 104m 136m A stone is thrown vertically upward with a speed of 6 m/s from the top of a building. The stone takes 4s to reach the ground. What is the height of the building?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "B",
        "explanation": "6*4+0.5*-9.81*4^2=-54.48"
    },
    {
        "number": 100,
        "text": "An object of mass 2 kg initially travels at a constant speed of 5 m/s. A force is applied to the object such that its kinetic energy is increased by 100 J. Estimate the final speed of the object.",
        "options": {
            "A": "1.2 m/s",
            "B": "2.4m/s",
            "C": "3.6m/s",
            "D": "4.8m/s"
        },
        "correct_answer": "A",
        "explanation": "100=0.5mv^2-0.5m5^2 v^2=(2(100))/2+5^2      v=11.2m/s"
    },
    {
        "number": 101,
        "text": "Trolley A moving at a velocity of 5 m/s collides with trolley B which is initially at rest. After collision, they move at a common velocity of 3 m/s If the mass of trolley B is 2 kg, find the mass of trolley A.",
        "options": {
            "A": "kg",
            "B": "kg",
            "C": "kg",
            "D": "kg"
        },
        "correct_answer": "C",
        "explanation": "ma(5)+mb(0) =(ma+mb)(3) ma(5) = (ma+2)(3) 2ma = 6           ma = 3kg"
    },
    {
        "number": 102,
        "text": "Which of the following is not a vector?",
        "options": {
            "A": "Velocity",
            "B": "Force",
            "C": "Momentum",
            "D": "Speed"
        },
        "correct_answer": "D",
        "explanation": "Basic knowledge written on tb"
    },
    {
        "number": 103,
        "text": "What factor(s) determine the momentum of a moving object? i) Velocity\tii)  Initial speed\tiii) Final speed\tiv) Mass",
        "options": {
            "A": "ii,iii",
            "B": "i, iv",
            "C": "i,ii,iii",
            "D": "ii,iii,iv"
        },
        "correct_answer": "B",
        "explanation": "The equation for momentum is momentum = mass × velocity"
    },
    {
        "number": 104,
        "text": "A falling skydiver straightens her legs to increase her surface area. This causes the skydiver to…",
        "options": {
            "A": "Decelerate upwards, magnitude of velocity decreases",
            "B": "Accelerate upwards, magnitude of velocity decreases",
            "C": "Decelerate upwards, magnitude of velocity increases",
            "D": "Accelerate upwards, magnitude of velocity increases"
        },
        "correct_answer": "B",
        "explanation": "Acceleration will cause an object to either: speed up, slow down or change direction. In this case she is falling downwards so an upwards acceleration will slow her speed (decrease her magnitude of velocity)."
    },
    {
        "number": 105,
        "text": "i) Staying at rest. ii) Moving backwards with acceleration 0 ms-2 iii) Turning right at constant speed of 2 ms-1 iv) Driving at speed of 1 ms-1 in a straight line without acceleration.",
        "options": {
            "A": "i,ii",
            "B": "i,iii",
            "C": "i,ii,iv",
            "D": "i,ii,iii,iv"
        },
        "correct_answer": "C",
        "explanation": "Changing direction = Changing velocity; 0 acceleration = 0 net force"
    },
    {
        "number": 106,
        "text": "A model truck A of mass 4.0 kg is travelling due west with a speed of 18 km h-1. A second truck B of mass 1.5 kg is travelling due east towards A with a speed of 8 m s–1. The trucks collide and stick together. Determine their velocity after the collision.",
        "options": {
            "A": "1.45 ms-1 (west)",
            "B": "1.45 ms-1 (east)",
            "C": "10.9 ms-1 (west)",
            "D": "10.9 ms-1 (east)"
        },
        "correct_answer": "A",
        "explanation": "Take west as +ve, \t\tm1v1 + m2v2 = mfvf ; 4*(18/3.6)+1.5*(-8) = (4+1.5)*vf vf = 1.45"
    },
    {
        "number": 107,
        "text": "A uniform plank of length 4 m and has a mass of 2 kg is pivoted at its center. A 4.905 N weight is placed 1 m to the left of the pivot. How far to the right of the pivot must a 9.81 N weight be placed to balance the plank?",
        "options": {
            "A": "0.25 m",
            "B": "0.5 m",
            "C": "1.0 m",
            "D": "2.0 m"
        },
        "correct_answer": "B",
        "explanation": "Pivoted at center; 4.905*1 = 9.81*d; d = 0.5"
    },
    {
        "number": 108,
        "text": "A construction crane lifts a 300 kg steel beam vertically upward at a constant speed of 0.5 ms-1. What is the crane's mechanical power output?",
        "options": {
            "A": "150 W",
            "B": "600 W",
            "C": "1470 W",
            "D": "2940 W"
        },
        "correct_answer": "C",
        "explanation": "Pt=W ; P*(1)=(300*9.81)*0.5 ; P = 1471.5"
    },
    {
        "number": 109,
        "text": "A roller coaster car starts from a speed of 50 kmh-1 at point A of height 60 m. What is its speed at point B with a height of 20 m?",
        "options": {
            "A": "28.0 ms-1",
            "B": "31.3 ms-1",
            "C": "57.3 ms-1",
            "D": "60.6 ms-1"
        },
        "correct_answer": "B",
        "explanation": "mgh+1/2mv2 = 1/2mv2 ; 9.81*(60-20)+(50/3.6)2/2 = v2/2 ; v = 31.3"
    },
    {
        "number": 110,
        "text": "A pendulum bob continues to swing after being released from a height of 1.25 m. What is its maximum speed and maximum height it can reach? Neglect air resistance.",
        "options": {
            "A": "4.95 ms-1; 1.25 m",
            "B": "4.95 ms-1; 1.2 m",
            "C": "3.50 ms-1; 1.25 m",
            "D": "3.50 ms-1; 1.2 m"
        },
        "correct_answer": "A",
        "explanation": "Energy always conserved ; mgh = 1/2mv2 ; 9.81*(1.25) = v2/2 ; v = 4.95"
    },
    {
        "number": 111,
        "text": "Which best describes the path of a projectile?",
        "options": {
            "A": "Straight line",
            "B": "Parabola",
            "C": "Circle",
            "D": "Hyperbola"
        },
        "correct_answer": "B",
        "explanation": "Projectiles follow a parabolic trajectory due to the combination of constant horizontal motion and accelerated vertical motion."
    },
    {
        "number": 112,
        "text": "In projectile motion, the horizontal component of velocity:",
        "options": {
            "A": "Decreases over time",
            "B": "Increases over time",
            "C": "Remains constant",
            "D": "Is zero at the peak"
        },
        "correct_answer": "C",
        "explanation": "Neglecting air resistance, horizontal velocity is constant because no force acts horizontally."
    },
    {
        "number": 113,
        "text": "What is the net force on an object moving at constant velocity?",
        "options": {
            "A": "Zero",
            "B": "Equal to its weight",
            "C": "Increasing with time",
            "D": "Equal to its mass"
        },
        "correct_answer": "A",
        "explanation": "Newton’s First Law states that if velocity is constant, net force must be zero (no acceleration)."
    },
    {
        "number": 114,
        "text": "If air resistance is negligible, which projectile will hit the ground first when launched horizontally from the same height?",
        "options": {
            "A": "A heavy cannonball",
            "B": "A light tennis ball",
            "C": "Both hit at the same time",
            "D": "It depends on the initial speed"
        },
        "correct_answer": "C",
        "explanation": "Without air resistance, all objects accelerate downward at g = 9.8 ms^-2, regardless of mass."
    },
    {
        "number": 115,
        "text": "What is the reaction force when you push against a wall?",
        "options": {
            "A": "The wall pushes back with equal force",
            "B": "The wall does not push back",
            "C": "The wall moves away",
            "D": "Gravity increases"
        },
        "correct_answer": "A",
        "explanation": "Newton’s Third Law states that every action has an equal and opposite reaction. The wall exerts a force back on you."
    },
    {
        "number": 116,
        "text": "A force of 36 N is applied to a 999 g object. What is the acceleration of the object?",
        "options": {
            "A": "0.36m/s²",
            "B": "36.0 m/s²",
            "C": "27.8 m/s²",
            "D": "2.78 m/s²"
        },
        "correct_answer": "B",
        "explanation": "F=ma (999g=0.999kg)"
    },
    {
        "number": 117,
        "text": "An object is moving at 25 m/s and comes to a stop in 5 seconds. What is the average acceleration?",
        "options": {
            "A": "-5 m/s²",
            "B": "-10 m/s²",
            "C": "10 m/s²",
            "D": "5 m/s²"
        },
        "correct_answer": "A",
        "explanation": "a=change in v/change in time"
    },
    {
        "number": 118,
        "text": "If a 0.0865 kg object is acted upon by a net force of  3N, what will be its acceleration?",
        "options": {
            "A": "34.6 m/s²",
            "B": "84.0 m/s²",
            "C": "29.9 m/s²",
            "D": "28.4 m/s²"
        },
        "correct_answer": "A",
        "explanation": "F=ma"
    },
    {
        "number": 119,
        "text": "A car accelerates from rest to  0.07 km/s in 2 seconds. What is the acceleration of the car?",
        "options": {
            "A": "30 m/s²",
            "B": "33 m/s²",
            "C": "35 m/s²",
            "D": "39 m/s²"
        },
        "correct_answer": "C",
        "explanation": "a=change in v/change in time"
    },
    {
        "number": 120,
        "text": "What is the weight of a 1g object on Earth (g = 9.8 m/s²)?",
        "options": {
            "A": "0.0098 N",
            "B": "0.098 N",
            "C": "0.98 N",
            "D": "9.8 N"
        },
        "correct_answer": "A",
        "explanation": "W=mg"
    },
    {
        "number": 121,
        "text": "If a 20 kg object is pushed with a force of 80 N, what is its acceleration?",
        "options": {
            "A": "2 m/s²",
            "B": "3 m/s²",
            "C": "4 m/s²",
            "D": "5 m/s²"
        },
        "correct_answer": "C",
        "explanation": "F=ma"
    },
    {
        "number": 122,
        "text": "An object is thrown upward with an initial velocity of 20 m/s. How high will it rise before coming to a stop?",
        "options": {
            "A": "10 m",
            "B": "20 m",
            "C": "30 m",
            "D": "40 m"
        },
        "correct_answer": "B",
        "explanation": "v2=u2+2as"
    },
    {
        "number": 123,
        "text": "A 5 kg object is sliding on a frictionless surface with a speed of 10 m/s. What is its momentum?",
        "options": {
            "A": "10 kg·m/s",
            "B": "25 kg·m/s",
            "C": "50 kg·m/s",
            "D": "100 kg·m/s"
        },
        "correct_answer": "C",
        "explanation": "p=mv"
    },
    {
        "number": 124,
        "text": "What is the net force acting on a 4 kg object that is accelerating at 3 m/s²?",
        "options": {
            "A": "4 N",
            "B": "12 N",
            "C": "16 N",
            "D": "20 N"
        },
        "correct_answer": "B",
        "explanation": "F=ma"
    },
    {
        "number": 125,
        "text": "People feel cooler when they get out of water after swimming. Which of the following is/are the reason(s) ? (1)The water on the skin evaporates. （2）The water on the skin absorbs latent heat of fusion. (3) The water on the skin releases latent heat of vaporization to the surrounding air.",
        "options": {
            "A": "1) only",
            "B": "3) only",
            "C": "1)(2) only",
            "D": "2)(3) only"
        },
        "correct_answer": "",
        "explanation": "when water evaporates water on the skin release heat"
    },
    {
        "number": 126,
        "text": "①）The gravitational force acting on the man increases. （2）The gravitational force acting on the lift increases. （3）The force acting on the man by the floor of the lift increases. A man is standing in a lift. The lift is initially at rest. When the lift starts to move upward, the man feels heavier. Which of the following statements is/are correct ?",
        "options": {
            "A": "1) only",
            "B": "3) only",
            "C": "1)(3)only",
            "D": ""
        },
        "correct_answer": "",
        "explanation": "when the mass remains constant, the acceleration increase the net force will increase"
    },
    {
        "number": 127,
        "text": "Which of the following changes will lead to a decrease in pressure, assuming the amount of gas remains the same?",
        "options": {
            "A": "Increasing the volume while keeping temperature constant.",
            "B": "Decreasing the volume while keeping temperature constant.",
            "C": "Increasing the temperature while keeping volume constant.",
            "D": "Adding more gas to the system at constant volume and temperature."
        },
        "correct_answer": "",
        "explanation": "PV=nRT"
    },
    {
        "number": 128,
        "text": "What happens to the pressure of a gas if its volume is halved while temperature remains constant?",
        "options": {
            "A": "ressure doubles",
            "B": "ressure halves",
            "C": "ressure remains the same",
            "D": "ressure quadruples"
        },
        "correct_answer": "",
        "explanation": "P∝1/V"
    },
    {
        "number": 129,
        "text": "2 identical ball shoot out from the same cannon at the same time. Ball A shoot at a 600 angle from the horizontal with 20 m/s speed.Ball B shoot horizontally with 10 m/s speed.Which of the following must be true?Assume no friction loss. When ball B touch the ground, ball A is above ball B. 2 balls will never meet",
        "options": {
            "A": "1)",
            "B": "2)",
            "C": "1),(2)",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "(1) same horizontal velocity,(2) they will meet when ball a touch the ground because they have the same velocity."
    },
    {
        "number": 130,
        "text": "2 identical ball shoot out from the same cannon at the same time. Ball A shoot at a 450 angle from the horizontal with 20 m/s speed.Ball B shoot horizontally with 10 m/s speed.Which of the following must be true?Assume no friction loss. When ball B touches the ground, ball A is above ball B. 2 balls will never meet",
        "options": {
            "A": "1)",
            "B": "2)",
            "C": "1),(2)",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "(1) Different horizontal velocity,(2) they will never meet because they have different velocity."
    },
    {
        "number": 131,
        "text": "2 identical balls shoot out from the same cannon at the same time. Ball A shoot at a 300 angle from the horizontal with 20 m/s speed.Ball B shoot horizontally with 17.3 m/s speed.Which of the following must be true?Assume no friction loss. (1)When ball B touches the ground, ball A is above ball B. (2)2 balls will never meet",
        "options": {
            "A": "1)",
            "B": "2)",
            "C": "1),(2)",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "(1) Different horizontal velocity,(2) they will never meet because they have different velocity."
    },
    {
        "number": 132,
        "text": "Assume no friction.When a man stands on the Earth, push the box forward with his hand, what will happen?",
        "options": {
            "A": "he box move forward",
            "B": "he box move backward",
            "C": "he box move upward",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "The box will not move because No friction between the man and the Earth so No force can act on the box by the man."
    },
    {
        "number": 133,
        "text": "Assume no friction and have air resistance.When a man stands on the Earth, pushes the box forward with his hand, what will happen?",
        "options": {
            "A": "he box move forward",
            "B": "he box move backward",
            "C": "he box move upward",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "The air will push the man forward, there is force act on the box by the man."
    },
    {
        "number": 134,
        "text": "When you are scrolling reels/shorts/tick tock, if you push your finger from bottom to top of the screen, what will happen?Assume no friction.",
        "options": {
            "A": "ou watch the next reel",
            "B": "ou watch the last reel",
            "C": "ou stay in the reel you are watching",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "The phone screen are not using touch sensor nowadays."
    },
    {
        "number": 135,
        "text": "When you are scrolling reels/shorts/tick tock, if you push your finger from bottom to top of the screen on an iPhone 4, what will happen?Assume no friction.",
        "options": {
            "A": "ou watch the next reel",
            "B": "ou watch the last reel",
            "C": "ou stay in the reel you are watching",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "Well with just touch sensor you can’t scroll"
    },
    {
        "number": 136,
        "text": "Marcy pulls a backpack on wheels down the 100m hall. The 60N force is applied at an angle of 30° above the horizontal. How much work is done by Marcy?",
        "options": {
            "A": "800",
            "B": "200",
            "C": "500",
            "D": "300"
        },
        "correct_answer": "",
        "explanation": "60 cos 30 x 100"
    },
    {
        "number": 137,
        "text": "A 30,000-kg freight car is coasting at 0.850 m/s and it crashed with a 10,000 kg train .  What is the final velocity of the freight car?",
        "options": {
            "A": ".3",
            "B": "",
            "C": ".396",
            "D": ".182"
        },
        "correct_answer": "",
        "explanation": "30000x0.850/(30000+110000)"
    },
    {
        "number": 138,
        "text": "What is the velocity of a 900-kg car initially moving at 30.0 m/s, just after it hits a 150-kg deer initially running at 12.0 m/s in the same direction? Assume the deer remains in the car.",
        "options": {
            "A": "0",
            "B": "7.4",
            "C": "2.1",
            "D": "4.6"
        },
        "correct_answer": "",
        "explanation": "900x30+150x12=(900+150)v"
    },
    {
        "number": 139,
        "text": "A tennis ball is struck such that it leaves the racket horizontally with a speed of 28.0 m/s. The ball hits the court at a horizontal distance of 19.6 m from the racket. What is the vertical height of the tennis ball when it leaves the racket?",
        "options": {
            "A": ".2",
            "B": ".7",
            "C": ".4",
            "D": ".4"
        },
        "correct_answer": "",
        "explanation": "19.6/28 t=0.7s 0.5x9.81x0.7^(2)"
    },
    {
        "number": 140,
        "text": "A nurse pushes a cart by exerting a force on the handle at a downward angle 35.0° below the horizontal. The loaded cart has a mass of 28.0 kg, and the force of friction is 60.0 N.What force must the nurse exert to move at a constant velocity?",
        "options": {
            "A": "6",
            "B": "3",
            "C": "4",
            "D": "0"
        },
        "correct_answer": "",
        "explanation": "60/ cos35"
    },
    {
        "number": 141,
        "text": "Two men A and B, of mass 40kg and 60kg respectively, pull each other by a rope. If they stand on a frictionless ground 50m apiece, find the distance from the original position of A when they meet each other.",
        "options": {
            "A": "0m",
            "B": "5m",
            "C": "0m",
            "D": "5m"
        },
        "correct_answer": "",
        "explanation": "Acceleration of A= F/60 Acceleration of B= F/60 S=½*(F/40)t^2 Ft^2 =80s 50-s= ½(F/60)t^2 S= 30"
    },
    {
        "number": 142,
        "text": "Which of the following statements about a free falling object travelling with decreasing speed under the influence of air resistance is/are correct? (1)Its acceleration is equal to acceleration due to gravity. (2)The net force acting on the object is decreasing. (3)The weight of the object is decreasing.",
        "options": {
            "A": "",
            "B": "",
            "C": "3",
            "D": "3"
        },
        "correct_answer": "",
        "explanation": "Take 'downward' direction as positive. Since its velocity (pointing downward, thus positive) is decreasing, its acceleration is negative. (1)× Since the acceleration is negative, it is not equal to that due to gravity, which is positive. 2)√ The object falls down with decreasing speed. That means the upward air resistance is larger than the weight. As the speed is decreasing, the air resistance is also decreasing. So the net force is also decreasing. 3x Weight is constant at sea level so acceleration due to gravity remains unchanged."
    },
    {
        "number": 143,
        "text": "Which of the following statements for an object momentarily at rest is/are correct? 1 The speed of the object is zero. 2 The net force acting on the object is zero. 3 A force is required to change the speed of the object.",
        "options": {
            "A": "only",
            "B": "only",
            "C": "3 only",
            "D": "3 only"
        },
        "correct_answer": "",
        "explanation": "1 ✓Speed and velocity are zero at rest 2 x The object is just momentarily at rest. Its speed is changing. That means it has acceleration, which is brought about by a net force. An example is a ball thrown up to its highest position. Its speed is zero but there is a force (the weight of the ball)acting downward. 3 ✓Without the action of a force, an object remains at rest or moves with constant speed."
    },
    {
        "number": 144,
        "text": "Which of the following statements best describes the concept of specific heat capacity?",
        "options": {
            "A": "he amount of heat required to raise the temperature of one kilogram of a substance by one degree Celsius.",
            "B": "he amount of heat required to raise the temperature of one gram of a substance by one degree Celsius.",
            "C": "The amount of heat required to melt one gram of a substance.",
            "D": "he amount of heat required to vaporize one kilogram of a substance."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Specific heat capacity is defined as the amount of heat required to raise the temperature of one kilogram of a substance by one degree Celsius. It is an intensive property of a material that reflects its ability to store heat."
    },
    {
        "number": 145,
        "text": "Which of the following materials is typically a good conductor of heat?",
        "options": {
            "A": "ood",
            "B": "lastic",
            "C": "Aluminum",
            "D": "tyrofoam"
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Aluminum is a good conductor of heat due to its high thermal conductivity. Good conductors allow heat to flow through them easily."
    },
    {
        "number": 146,
        "text": "According to Newton's First Law of Motion, an object will remain at rest or in uniform motion in a straight line unless acted upon by:",
        "options": {
            "A": "net external force.",
            "B": "n internal force.",
            "C": "ravity.",
            "D": "riction."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Newton's First Law states that an object will remain at rest or in uniform motion unless acted upon by a net external force. Internal forces and external forces that cancel out do not cause a change in motion."
    },
    {
        "number": 147,
        "text": "When an object is in free fall near the surface of the Earth, the acceleration due to gravity is approximately:",
        "options": {
            "A": ".8 m/s^2",
            "B": "1.6 m/s^2",
            "C": "3.0 m/s^2",
            "D": ".5 m/s^2"
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Near the surface of the Earth, the acceleration due to gravity is approximately 9.8 m/s^2. This value is commonly used in physics calculations involving free fall."
    },
    {
        "number": 148,
        "text": "Which of the following best describes the process of convection?",
        "options": {
            "A": "eat transfer through direct contact between particles of a substance.",
            "B": "Heat transfer through electromagnetic waves.",
            "C": "Heat transfer through the movement of fluid particles.",
            "D": "Heat transfer through the vibration of particles in a substance"
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Convection is the process of heat transfer through the movement of fluid particles. This movement results in the transfer of heat from one place to another."
    },
    {
        "number": 149,
        "text": "Which of the following best describes the concept of thermal equilibrium?",
        "options": {
            "A": "hen two objects have the same temperature.",
            "B": "hen two objects have different temperatures.",
            "C": "hen heat is transferred from a hot object to a cold object.",
            "D": "hen no heat is transferred between two objects."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Thermal equilibrium is achieved when two objects have the same temperature and no net heat flows between them."
    },
    {
        "number": 150,
        "text": "What happens to the volume of most substances when they are heated?",
        "options": {
            "A": "The volume decreases.",
            "B": "he volume remains constant.",
            "C": "The volume increases.",
            "D": "The volume fluctuates randomly."
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Most substances expand when heated, which causes their volume to increase. This phenomenon is known as thermal expansion."
    },
    {
        "number": 151,
        "text": "Which of the following is a scalar quantity?",
        "options": {
            "A": "orce",
            "B": "elocity",
            "C": "cceleration",
            "D": "ass"
        },
        "correct_answer": "",
        "explanation": "The correct answer is D. Mass is a scalar quantity because it only has magnitude and no direction associated with it. Scalar quantities are fully described by a magnitude alone."
    },
    {
        "number": 152,
        "text": "In which scenario would an object experience zero net force?",
        "options": {
            "A": "A car moving at a constant speed around a circular track.",
            "B": "A ball rolling down a hill.",
            "C": "A rocket taking off into space.",
            "D": "book resting on a table."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. When an object moves at a constant speed in a circular path, the net force acting on it is zero. This is because the centripetal force required for circular motion is balanced by other forces."
    },
    {
        "number": 153,
        "text": "Which of the following best describes the concept of specific latent heat?",
        "options": {
            "A": "he amount of heat required to raise the temperature of a substance by one degree Celsius.",
            "B": "The amount of heat required to melt or vaporize a unit mass of a substance without a change in temperature.",
            "C": "The amount of heat required to raise the temperature of a substance by one Kelvin.",
            "D": "he amount of heat required to maintain a substance at a constant temperature."
        },
        "correct_answer": "",
        "explanation": "The correct answer is B. Specific latent heat refers to the amount of heat required to change the state of a substance (e.g., melting or vaporization) without a change in temperature. It is a characteristic property of the substance."
    },
    {
        "number": 154,
        "text": "A van of mass 1000kg decelerates uniformly from 40ms^[-1] to stop in 50m along a horizontal road. Find the friction acting on the car.",
        "options": {
            "A": "000N",
            "B": "0000N",
            "C": "6000N",
            "D": "0000N"
        },
        "correct_answer": "C",
        "explanation": "KE1 +PE1 =KE2+PE2+Workdone by friction ½ 1000*40^[2]=50f F=16000N"
    },
    {
        "number": 155,
        "text": "On a smooth surface, ball A and ball B collide. A of 100g moves at 3ms^[-1] towards right and B of 50g moves at 5ms ^[-1] both just right before collision.Which of the following is/are the possible results . 1)A stops 2)B stops 3)Both moves at 0.33 ms^[-1] towards the right after collision",
        "options": {
            "A": "only",
            "B": ",2 only",
            "C": "only",
            "D": ",2,3"
        },
        "correct_answer": "C",
        "explanation": "Initial momentum: Take rightwards as positive (0.1*3)+(0.05*-5)=0.05kg m/s As it is an inelastic collision,if both balls were to stop completely after the collision, the total final momentum would be zero. Since momentum is conserved, if the initial momentum is not zero, the final momentum cannot be zero.And none of the ball will stop because the final velocity is not zero. 0.05=(0.1+0.05)v V=0.33m/s (rightwards) Only 3 is correct"
    },
    {
        "number": 156,
        "text": "Water enters and leaves the hose at the same speed 5ms and 800g water flows out of hose each second. The child bends the hose so that he could pour the water into the pool. The water flows from the ground to the pool with the hose rolled up for few times. Which of the following statements is true.",
        "options": {
            "A": "he momentum of water is conserved.",
            "B": "he momentum of water is changed.",
            "C": "here is no net force acting on the water",
            "D": "here is no force acting on the hose."
        },
        "correct_answer": "B",
        "explanation": "because the direction of velocity of water has changed Net force acting on water is equal to the rate of change in momentum of water.There is change in momentum of water, there is net force. There is force acting on the hose , by Newton third law,as the hose exert force on water, water exert a force on hose too."
    },
    {
        "number": 157,
        "text": "Two containers containing the same ideal gas, Container A is 50m^[3] ,container B is 10m^[3]. They are connected by a tube with a tap closed initially. Which of the following quantity will become the same after opening the tap? The number of moles of gas in each container The number molecules of gas in each container The air pressure in each container",
        "options": {
            "A": "only",
            "B": "and 3",
            "C": "and 3",
            "D": "only"
        },
        "correct_answer": "",
        "explanation": "The gas will redistribute  based on the volume of containers, so neither the number of moles nor the molecules will become the same.However after opening the tap, the pressure in each container will be equalized."
    },
    {
        "number": 158,
        "text": "A man stands on a weighing scale inside a lift. The scale reads 690 N. What will the scale read if the lift accelerates upwards at 3ms^[-1] ?",
        "options": {
            "A": "50N",
            "B": "10N",
            "C": "02N",
            "D": "54N"
        },
        "correct_answer": "",
        "explanation": "690/9.81 =70.336 kg Fnet=ma W=70.4*(9.81+3) W=901.8N"
    },
    {
        "number": 159,
        "text": "Match each observation (1–3) to the correct gas law (A–C): 1.When temperature decreased, the gas volume decreases at constant pressure. 2.When compressed, the gas pressure increases at constant temperature. 3.When heated, the gas pressure increases at constant volume.",
        "options": {
            "A": "1:a  2:b  3:c",
            "B": "Charles’ Law",
            "C": "Pressure Law",
            "D": ""
        },
        "correct_answer": "D",
        "explanation": "1. Volume decreases when cooled (constant P) 2.Pressure increases when compressed (constant T) 3.Pressure increases when heated (constant V)"
    },
    {
        "number": 160,
        "text": "A cylinder contains an ideal gas at 27°c with a pressure of 200 kPa. If the temperature rises to 150 °c while the volume remains constant, what is the new pressure of the gas?",
        "options": {
            "A": "182 kPa",
            "B": "234 kPa",
            "C": "282 kPa",
            "D": "316 kPa"
        },
        "correct_answer": "C",
        "explanation": ": 200/(273+27)=  P/ (273+150)"
    },
    {
        "number": 161,
        "text": "A beam with length of 6m , self weight if 2kg  is balanced at its pivot. A 3 kg mass is placed 1 meter to the left of the pivot. What mass must be placed 3 meters to the right of the pivot to keep the beam in equilibrium?",
        "options": {
            "A": "kg",
            "B": "kg",
            "C": ".5kg",
            "D": "kg"
        },
        "correct_answer": "",
        "explanation": "Total Momentclockwise=Moment Beam+Moment left=58.86+29.43=88.29(nm) Moment right​=m×9.81×3=29.43m(nm) Anticlockwise =clockwise 88.29/29.43=m M=3 kg"
    },
    {
        "number": 162,
        "text": "When an object is projected vertically upwards, its velocity is ___ at the highest point.",
        "options": {
            "A": "ame as start",
            "B": "ero",
            "C": "ncreased",
            "D": "ecreased"
        },
        "correct_answer": "B",
        "explanation": "It will stop at the highest point as gravity is added on the object"
    },
    {
        "number": 163,
        "text": "When a person walks forwards, what direction does the friction act on the person by the ground point to? i)backwards ii)forwards iii)downwards",
        "options": {
            "A": "i only",
            "B": "and iii only",
            "C": "i and iii only",
            "D": "ll of the above"
        },
        "correct_answer": "",
        "explanation": "acted on the person by ground = direction of person"
    },
    {
        "number": 164,
        "text": "A ball is thrown horizontally at a velocity of 20 m/s from a height of 10 m. How far does it travel horizontally before impact?",
        "options": {
            "A": "8.6m",
            "B": ".81m",
            "C": "0.2m",
            "D": "0m"
        },
        "correct_answer": "",
        "explanation": "calculation"
    },
    {
        "number": 165,
        "text": "Which of the following statements is true about Newton’s FIRST Law?",
        "options": {
            "A": "An object at rest remains at rest unless there is an unbalanced force acting on it.",
            "B": "The net force acting on an object is equal to its mass times its acceleration.",
            "C": "For every action, there is an equal and opposite reaction.",
            "D": "Mr Man is very cute."
        },
        "correct_answer": "A",
        "explanation": "All of them are true but only A is related to Newton’s first law."
    },
    {
        "number": 166,
        "text": "Mr Man and Mr Hung both run from A to B. Mr Man has an average speed of 1ms-1 and Mr Hung has an average speed of 2ms-1. Which of the following must be true?",
        "options": {
            "A": "The magnitude of Mr Hung’s average velocity is higher than the magnitude of Mr Man’s average velocity.",
            "B": "If they start at A at the same time, Mr Hung will reach B first.",
            "C": "The displacement of Mr Man is the same as the displacement of Mr Hung.",
            "D": "None of the above"
        },
        "correct_answer": "C",
        "explanation": "They have the same starting point and ending point so their displacement is the same. Their distance travelled may be different so A and B may not be true."
    },
    {
        "number": 167,
        "text": "Box A of mass 30kg and Box B of mass 3kg were released from rest in vacuum. Which box will reach the ground first?",
        "options": {
            "A": "Box A",
            "B": "Box B",
            "C": "They reach the ground at the same time",
            "D": "Cannot determine"
        },
        "correct_answer": "C",
        "explanation": "The acceleration of free falling objects are the same. So the time needed to reach the ground is also the same."
    },
    {
        "number": 168,
        "text": "Ball X is of the same size as ball Y but is much heavier. They are released from rest at the same time from a certain height. Which of the following statements about the balls is/are correct? (1) X reaches the ground before Y. (2) The velocity of each ball increases uniformly. (3) Their accelerations are zero when they are just released.",
        "options": {
            "A": "(1)only",
            "B": "1) and (2) only",
            "C": "2) only",
            "D": "1) and (3) only"
        },
        "correct_answer": "C",
        "explanation": "Y should reaches ground before x, acceleration =9.81"
    },
    {
        "number": 169,
        "text": "Which of the following statements about force is incorrect?",
        "options": {
            "A": "orce is a vector quantity",
            "B": "orces always exist in pairs",
            "C": "n object can exert a force on another object only id the two objects are incontact",
            "D": "he unit of force is newton"
        },
        "correct_answer": "C",
        "explanation": "There’s non contact force"
    },
    {
        "number": 170,
        "text": "Which of the following statements is/are correct? (1) When moving at the same speed, a bowling ball is harder to stop than a ping-pong ball. (2) Objects always have the same inertia when they are at rest. (3) When a bus accelerates forwards suddenly, passengers inside lean backwards because they are acted on by friction.",
        "options": {
            "A": "(1) only",
            "B": "(2) and (3) only",
            "C": "3) only",
            "D": "1),(2) and (3)"
        },
        "correct_answer": "",
        "explanation": ""
    },
    {
        "number": 171,
        "text": "Assume that the ball slows down uniformly. If the velocity of the ball after being kicked is u m s what is the net force acting on the ball when it rolls. A boy kicks a ball of mass 1.2 kg on level grassland. The ball rolls for 20 m before it stops.",
        "options": {
            "A": "0.01 u2 N",
            "B": ".02 u2 N",
            "C": ".03 u2 N",
            "D": ""
        },
        "correct_answer": "",
        "explanation": "by v2=u2 + 2as, a= u/40. By F=ma, F= 1.2u/40=0.03"
    },
    {
        "number": 172,
        "text": "Which one is correct when a fixed mass of gas is compressed and also heated at the same time? 1.Average spacing between the gas molecules 2.Average speed of the gas  molecules",
        "options": {
            "A": "1.remains unchanged 2.increases",
            "B": "1.decreases 2.increases",
            "C": "1.decreases 2.decreases",
            "D": "1.decreases 2.remains unchanged"
        },
        "correct_answer": "B",
        "explanation": "it is because the gas molecules will go faster when the temperature is higher"
    },
    {
        "number": 173,
        "text": "According to the kinetic theory of gases, which of the following statements is incorrect for an ideal gas?",
        "options": {
            "A": "The pressure exerted by the gas arises due to collisions of molecules with the container walls",
            "B": "The average kinetic energy of the gas molecules is directly proportional to the absolute temperature",
            "C": "Gas molecules exert strong intermolecular forces on each other except during collisions",
            "D": "The r.m.s. speed of the gas molecules depends on both the temperature and the molar mass of the gas"
        },
        "correct_answer": "C",
        "explanation": "It is because ideal gas molecules exert no intermolecular forces"
    },
    {
        "number": 174,
        "text": "An ideal gas is heated at constant volume. Which of the following quantities must increase?",
        "options": {
            "A": "Root-mean-square (r.m.s.) speed of molecules",
            "B": "Potential energy of the gas",
            "C": "Average intermolecular distance",
            "D": "Number of molecules per unit volume"
        },
        "correct_answer": "A",
        "explanation": "The r.m.s. speed of molecules depends on temperature which increases when heated"
    },
    {
        "number": 175,
        "text": "When you heat an ideal gas, what happens to its molecules?",
        "options": {
            "A": "Move faster",
            "B": "Move slower",
            "C": "Become heavier",
            "D": "Become Lighter"
        },
        "correct_answer": "A",
        "explanation": "Gas molecules move faster when the temperature is higher"
    },
    {
        "number": 176,
        "text": "Two ideal gas samples in identical containers are at the same temperature but have different molecular masses. Which statement is correct?",
        "options": {
            "A": "Both samples exert equal pressure on their containers",
            "B": "The lighter molecules collide with the container walls more frequently",
            "C": "Both samples have molecules with the same average speed",
            "D": "The heavier molecules have greater average kinetic energy"
        },
        "correct_answer": "B",
        "explanation": "Lighter molecules move faster so there will be more frequent wall collisions"
    },
    {
        "number": 177,
        "text": "Ball X is of the same size as ball Y but is much heavier. They are released from rest at the same time from a certain height. Which of the following statements about the balls is/are correct? (1) X reaches the ground before Y. (2) The velocity of each ball increases uniformly. (3) Their accelerations are zero when they are just released.",
        "options": {
            "A": "(1)only",
            "B": "1) and (2) only",
            "C": "2) only",
            "D": "1) and (3) only"
        },
        "correct_answer": "C",
        "explanation": "Y should reaches ground before x, acceleration =9.81"
    },
    {
        "number": 178,
        "text": "Which of the following statements about force is incorrect?",
        "options": {
            "A": "orce is a vector quantity",
            "B": "orces always exist in pairs",
            "C": "n object can exert a force on another object only id the two objects are incontact",
            "D": "he unit of force is newton"
        },
        "correct_answer": "C",
        "explanation": "There’s non contact force"
    },
    {
        "number": 179,
        "text": "Which of the following statements is/are correct? (1) When moving at the same speed, a bowling ball is harder to stop than a ping-pong ball. (2) Objects always have the same inertia when they are at rest. (3) When a bus accelerates forwards suddenly, passengers inside lean backwards because they are acted on by friction.",
        "options": {
            "A": "(1) only",
            "B": "(2) and (3) only",
            "C": "3) only",
            "D": "1),(2) and (3)"
        },
        "correct_answer": "",
        "explanation": ""
    },
    {
        "number": 180,
        "text": "Assume that the ball slows down uniformly. If the velocity of the ball after being kicked is u m s what is the net force acting on the ball when it rolls. A boy kicks a ball of mass 1.2 kg on level grassland. The ball rolls for 20 m before it stops.",
        "options": {
            "A": "0.01 u2 N",
            "B": ".02 u2 N",
            "C": ".03 u2 N",
            "D": ""
        },
        "correct_answer": "",
        "explanation": "by v2=u2 + 2as, a= u/40. By F=ma, F= 1.2u/40=0.03"
    },
    {
        "number": 181,
        "text": "Which of the following statements best describes the concept of specific heat capacity?",
        "options": {
            "A": "he amount of heat required to raise the temperature of one kilogram of a substance by one degree Celsius.",
            "B": "he amount of heat required to raise the temperature of one gram of a substance by one degree Celsius.",
            "C": "The amount of heat required to melt one gram of a substance.",
            "D": "he amount of heat required to vaporize one kilogram of a substance."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Specific heat capacity is defined as the amount of heat required to raise the temperature of one kilogram of a substance by one degree Celsius. It is an intensive property of a material that reflects its ability to store heat."
    },
    {
        "number": 182,
        "text": "Which of the following materials is typically a good conductor of heat?",
        "options": {
            "A": "ood",
            "B": "lastic",
            "C": "Aluminum",
            "D": "tyrofoam"
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Aluminum is a good conductor of heat due to its high thermal conductivity. Good conductors allow heat to flow through them easily."
    },
    {
        "number": 183,
        "text": "According to Newton's First Law of Motion, an object will remain at rest or in uniform motion in a straight line unless acted upon by:",
        "options": {
            "A": "net external force.",
            "B": "n internal force.",
            "C": "ravity.",
            "D": "riction."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Newton's First Law states that an object will remain at rest or in uniform motion unless acted upon by a net external force. Internal forces and external forces that cancel out do not cause a change in motion."
    },
    {
        "number": 184,
        "text": "When an object is in free fall near the surface of the Earth, the acceleration due to gravity is approximately:",
        "options": {
            "A": ".8 m/s^2",
            "B": "1.6 m/s^2",
            "C": "3.0 m/s^2",
            "D": ".5 m/s^2"
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Near the surface of the Earth, the acceleration due to gravity is approximately 9.8 m/s^2. This value is commonly used in physics calculations involving free fall."
    },
    {
        "number": 185,
        "text": "Which of the following best describes the process of convection?",
        "options": {
            "A": "eat transfer through direct contact between particles of a substance.",
            "B": "Heat transfer through electromagnetic waves.",
            "C": "Heat transfer through the movement of fluid particles.",
            "D": "Heat transfer through the vibration of particles in a substance"
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Convection is the process of heat transfer through the movement of fluid particles. This movement results in the transfer of heat from one place to another."
    },
    {
        "number": 186,
        "text": "Which of the following best describes the concept of thermal equilibrium?",
        "options": {
            "A": "hen two objects have the same temperature.",
            "B": "hen two objects have different temperatures.",
            "C": "hen heat is transferred from a hot object to a cold object.",
            "D": "hen no heat is transferred between two objects."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. Thermal equilibrium is achieved when two objects have the same temperature and no net heat flows between them."
    },
    {
        "number": 187,
        "text": "What happens to the volume of most substances when they are heated?",
        "options": {
            "A": "The volume decreases.",
            "B": "he volume remains constant.",
            "C": "The volume increases.",
            "D": "The volume fluctuates randomly."
        },
        "correct_answer": "",
        "explanation": "The correct answer is C. Most substances expand when heated, which causes their volume to increase. This phenomenon is known as thermal expansion."
    },
    {
        "number": 188,
        "text": "Which of the following is a scalar quantity?",
        "options": {
            "A": "orce",
            "B": "elocity",
            "C": "cceleration",
            "D": "ass"
        },
        "correct_answer": "",
        "explanation": "The correct answer is D. Mass is a scalar quantity because it only has magnitude and no direction associated with it. Scalar quantities are fully described by a magnitude alone."
    },
    {
        "number": 189,
        "text": "In which scenario would an object experience zero net force?",
        "options": {
            "A": "A car moving at a constant speed around a circular track.",
            "B": "A ball rolling down a hill.",
            "C": "A rocket taking off into space.",
            "D": "book resting on a table."
        },
        "correct_answer": "",
        "explanation": "The correct answer is A. When an object moves at a constant speed in a circular path, the net force acting on it is zero. This is because the centripetal force required for circular motion is balanced by other forces."
    },
    {
        "number": 190,
        "text": "Which of the following best describes the concept of specific latent heat?",
        "options": {
            "A": "he amount of heat required to raise the temperature of a substance by one degree Celsius.",
            "B": "The amount of heat required to melt or vaporize a unit mass of a substance without a change in temperature.",
            "C": "The amount of heat required to raise the temperature of a substance by one Kelvin.",
            "D": "he amount of heat required to maintain a substance at a constant temperature."
        },
        "correct_answer": "",
        "explanation": "The correct answer is B. Specific latent heat refers to the amount of heat required to change the state of a substance (e.g., melting or vaporization) without a change in temperature. It is a characteristic property of the substance."
    },
    {
        "number": 191,
        "text": "What is the formula for calculating speed?",
        "options": {
            "A": "Speed = Distance × Time",
            "B": "Speed = Distance / Time",
            "C": "Speed = Time / Distance",
            "D": "Speed = Distance + Time"
        },
        "correct_answer": "B",
        "explanation": "Speed tells us how fast something is moving, calculated by dividing the distance traveled by the time taken."
    },
    {
        "number": 192,
        "text": "If a car travels 100 meters in 5 seconds, what is its speed?",
        "options": {
            "A": "10 m/s",
            "B": "15 m/s",
            "C": "20 m/s",
            "D": "25 m/s"
        },
        "correct_answer": "C",
        "explanation": "Speed is calculated by dividing 100 meters by 5 seconds, resulting in 20 meters per second."
    },
    {
        "number": 193,
        "text": "What is the difference between speed and velocity?",
        "options": {
            "A": "Speed is faster than velocity.",
            "B": "Speed is a vector; velocity is a scalar.",
            "C": "Speed is a scalar; velocity is a vector.",
            "D": "There is no difference."
        },
        "correct_answer": "C",
        "explanation": "Speed has magnitude only, while velocity includes both magnitude and direction."
    },
    {
        "number": 194,
        "text": "What is Newton's first law of motion?",
        "options": {
            "A": "Force equals mass times acceleration.",
            "B": "For every action, there is an equal and opposite reaction.",
            "C": "An object in motion stays in motion unless acted upon.",
            "D": "Energy cannot be created or destroyed."
        },
        "correct_answer": "C",
        "explanation": "This law states that objects will not change their state of motion unless a force acts on them."
    },
    {
        "number": 195,
        "text": "If a ball is thrown upwards, what happens to its velocity as it rises?",
        "options": {
            "A": "It increases.",
            "B": "It decreases.",
            "C": "It stays the same.",
            "D": "It becomes negative."
        },
        "correct_answer": "B",
        "explanation": "As the ball rises, gravity slows it down until it stops at the highest point."
    },
    {
        "number": 196,
        "text": "What is the unit of force in the International System of Units ?",
        "options": {
            "A": "Joule",
            "B": "Newton",
            "C": "Pascal",
            "D": "Watt"
        },
        "correct_answer": "B",
        "explanation": "The Newton (N) is the standard unit for measuring force."
    },
    {
        "number": 197,
        "text": "What is the freezing point of water in degrees Celsius?",
        "options": {
            "A": "-10°C",
            "B": "0°C",
            "C": "10°C",
            "D": "100°C"
        },
        "correct_answer": "B",
        "explanation": "Water freezes at 0 degrees Celsius, the temperature at which it changes from liquid to solid."
    },
    {
        "number": 198,
        "text": "What instrument is used to measure temperature?",
        "options": {
            "A": "Barometer",
            "B": "Anemometer",
            "C": "Thermometer",
            "D": "Hygrometer"
        },
        "correct_answer": "C",
        "explanation": "A thermometer is designed to measure temperature, using liquid or digital sensors."
    },
    {
        "number": 199,
        "text": "At what temperature does water boil in degrees Celsius?",
        "options": {
            "A": "90°C",
            "B": "100°C",
            "C": "110°C",
            "D": "120°C"
        },
        "correct_answer": "B",
        "explanation": "Water boils at 100 degrees Celsius, changing from liquid to gas ."
    },
    {
        "number": 200,
        "text": "What happens to the molecules of a substance as its temperature increases?",
        "options": {
            "A": "They move slower.",
            "B": "They move faster and spread apart.",
            "C": "They stay still.",
            "D": "They become heavier."
        },
        "correct_answer": "B",
        "explanation": "As temperature rises, molecules gain energy, moving faster and spreading apart."
    },
    {
        "number": 201,
        "text": "200 J 50 J 20 J 8 J A block is pulled along a horizontal bench at a constant velocity of 10m/s by a force of 5 N. What is the work done against friction in 5 seconds?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "A",
        "explanation": "5*40=200"
    },
    {
        "number": 202,
        "text": "An ideal gas of mass 100 g is stored in a rigid container. Suppose its molecules have a root-mean-square speed of 200 m s' when the gas pressure is 300 kPa, what is the volume of the container?",
        "options": {
            "A": ".22x10^-5 m^3",
            "B": ".44x10^-3 m^3",
            "C": ".66x10^-3 m^3",
            "D": ".33×10^-2 m^3"
        },
        "correct_answer": "B",
        "explanation": ""
    },
    {
        "number": 203,
        "text": "final speed:5m/s distance:25m final speed:5m/s distance:50m final speed:10m/s distance:25m final speed:10m/s distance:50m A car speeds up from rest at a uniform acceleration of 2 m^-2 for 5 seconds. What is the final speed and distance travelled by the car?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "C",
        "explanation": "0+2*5=10m/s ((5)^2*2)/2=25m"
    },
    {
        "number": 204,
        "text": "24m 54.5m 104m 136m A stone is thrown vertically upward with a speed of 6 m/s from the top of a building. The stone takes 4s to reach the ground. What is the height of the building?",
        "options": {
            "A": "",
            "B": "",
            "C": "",
            "D": ""
        },
        "correct_answer": "B",
        "explanation": "6*4+0.5*-9.81*4^2=-54.48"
    },
    {
        "number": 205,
        "text": "An object of mass 2 kg initially travels at a constant speed of 5 m/s. A force is applied to the object such that its kinetic energy is increased by 100 J. Estimate the final speed of the object.",
        "options": {
            "A": "1.2 m/s",
            "B": "2.4m/s",
            "C": "3.6m/s",
            "D": "4.8m/s"
        },
        "correct_answer": "A",
        "explanation": "100=0.5mv^2-0.5m5^2 v^2=(2(100))/2+5^2      v=11.2m/s"
    },
    {
        "number": 206,
        "text": "Trolley A moving at a velocity of 5 m/s collides with trolley B which is initially at rest. After collision, they move at a common velocity of 3 m/s If the mass of trolley B is 2 kg, find the mass of trolley A.",
        "options": {
            "A": "kg",
            "B": "kg",
            "C": "kg",
            "D": "kg"
        },
        "correct_answer": "C",
        "explanation": "ma(5)+mb(0) =(ma+mb)(3) ma(5) = (ma+2)(3) 2ma = 6           ma = 3kg"
    },
    {
        "number": 207,
        "text": "According to Newton's First Law of Motion, an object at rest will stay at rest and an object in motion will stay in motion with the same velocity unless acted upon by:",
        "options": {
            "A": "gravity",
            "B": "friction",
            "C": "an unbalanced force",
            "D": "air resistance"
        },
        "correct_answer": "C",
        "explanation": "Object's state of motion will remain constant unless a net or unbalanced force acts upon it."
    },
    {
        "number": 208,
        "text": "Which of the following is a vector?",
        "options": {
            "A": "speed",
            "B": "distance",
            "C": "velocity",
            "D": "mass"
        },
        "correct_answer": "C",
        "explanation": "Velocity has direction."
    },
    {
        "number": 209,
        "text": "Two objects have masses m1​ and m2​, where m1​>m2​. If the same force is applied to both objects, which object will experience a greater acceleration?",
        "options": {
            "A": "The object with mass m1​",
            "B": "The object with mass m2",
            "C": "Same",
            "D": "It depends on the shape of the objects"
        },
        "correct_answer": "B",
        "explanation": "The object with the smaller mass (m2​) will experience a greater acceleration for the same applied force."
    },
    {
        "number": 210,
        "text": "The force that opposes the motion of an object moving through a fluid (like air or water) is called:",
        "options": {
            "A": "gravity",
            "B": "normal force",
            "C": "friction",
            "D": "drag force"
        },
        "correct_answer": "D",
        "explanation": "Drag force is a type of friction that acts on objects moving through fluids."
    },
    {
        "number": 211,
        "text": "Which of the following scenarios demonstrates Newton's Third Law of Motion?",
        "options": {
            "A": "A car accelerates when the driver presses the gas pedal",
            "B": "A book rests on a table, and the table exerts an upward force on the book",
            "C": "A ball rolling on a flat surface eventually comes to a stop due to friction",
            "D": "A rocket propels forward by expelling hot gases out of its back"
        },
        "correct_answer": "D",
        "explanation": "Action reaction pair."
    },
    {
        "number": 212,
        "text": "Which of the following processes release latent heat?",
        "options": {
            "A": "melting",
            "B": "vaporization",
            "C": "solidification",
            "D": "boiling"
        },
        "correct_answer": "C",
        "explanation": "the question ask for releases latent heat , so the answer not A, B, and D"
    },
    {
        "number": 213,
        "text": "A sealed container holds a gas at 300K. If the gas is heated so that its pressure increases from 60kPa to 180kPa, what is its final temperature? Assume the volume of the gas is fixed.",
        "options": {
            "A": "36K",
            "B": "100K",
            "C": "627K",
            "D": "900K"
        },
        "correct_answer": "",
        "explanation": "60/300=180/T T=900K"
    },
    {
        "number": 214,
        "text": "A sealed syringe is filled with 30cm3 of air at a temperature of 29°C. The syringe is cooled to 4°C in a freezer. What is the new volume of the air? Assume the air pressure inside the syringe remains constant.",
        "options": {
            "A": "4.14cm3",
            "B": "27.5cm3",
            "C": "3.87cm3",
            "D": "287cm3"
        },
        "correct_answer": "B",
        "explanation": "30/(29+273)=V/(4+273) V=27.5cm3"
    },
    {
        "number": 215,
        "text": "A sealed syringe contains 80cm3 of air at a temperature of 27°C and a pressure of 100kPa. When the piston is quickly pushed inwards to reduce the volume to 70cm3, the temperature rises to 33°C.  What is the new pressure?",
        "options": {
            "A": "117kPa",
            "B": "81.6kPa",
            "C": "207kPa",
            "D": "140kPa"
        },
        "correct_answer": "A",
        "explanation": "100(80)/(27+273)=P(70)/(33+273) P=117kPa"
    },
    {
        "number": 216,
        "text": "A sealed can of volume 350cm3 contains an ideal gas at 115kPa and 20°C. What is the number of moles of gas in the can? Take R to be 8.31 J mol-1 K-1.",
        "options": {
            "A": "16.5 mol",
            "B": "0.0165 mol",
            "C": "0.0177*10 ^-3 mol",
            "D": "0.0177 mol"
        },
        "correct_answer": "B",
        "explanation": "pV=nRT n=pV/RT=(115*10^3)(350*10^-6)/8.31(20+273) n=0.0165 mol"
    },
    {
        "number": 217,
        "text": "A man is pushing a car but the car does not move. If the pushing force on the car by the man is the action force, what is the reaction force?",
        "options": {
            "A": "the force acting on the man by the ground",
            "B": "the force acting on the ground by the man",
            "C": "the force acting on the man by the car",
            "D": "the force acting on the car by the man"
        },
        "correct_answer": "C",
        "explanation": "the pushing force on the car by the man, so the answer is not A or B. Every action is an equal and opposite reaction, so the answer is C."
    },
    {
        "number": 218,
        "text": "The masses of blocks A and B are 6 kg and 4 kg respectively. They are connected by a string on the smooth horizontal plane. If A is pulled by a horizontal force of 20 N and the two blocks move to the right together, what is the tension in the string?",
        "options": {
            "A": "6N",
            "B": "12N",
            "C": "24N",
            "D": "30N"
        },
        "correct_answer": "B",
        "explanation": "Fnet = ma\t\t\t\t\tT=6*2 a=2m s^-2\t\t\t\tT=12N"
    },
    {
        "number": 219,
        "text": "A puppy pulls a towel and remains stationary on the ground. The towel makes an angle of 30° to the horizontal and the tension in it is 10N. Find the friction acting on the puppy by the ground?",
        "options": {
            "A": "5N",
            "B": "8.66N",
            "C": "5.21N",
            "D": "29.5N"
        },
        "correct_answer": "B",
        "explanation": "10 cos 30° =8.66 N"
    },
    {
        "number": 220,
        "text": "A spaceship of mass 120 kg flies forwards in outer space. Its rocket is fired to speed up the spaceship from 50 m s^-1 to 60 m s^-1 in 20 s. Assume that the power provided by the rocket is constant and the resistive force acting on the spaceship is negligible. Find the power of the rocket.",
        "options": {
            "A": "33 W",
            "B": "330 W",
            "C": "3300 W",
            "D": "3.3*10^4 W"
        },
        "correct_answer": "C",
        "explanation": "½ mu^2+Pt=½ mv^2 P=½ *120*(60^2-50^2)/20 P=3300W"
    },
    {
        "number": 221,
        "text": "Jason of mass 50 kg holds a 2 kg ball and skates forwards at 3 m s^-1 . Then he throws the ball so that it moves forwards at 10 m s^-1. What is his velocity after throwing the ball?",
        "options": {
            "A": "1.61 m s^-1",
            "B": "2.04 m s^-1",
            "C": "2.72 m s^-1",
            "D": "4.39 m s^-1"
        },
        "correct_answer": "C",
        "explanation": "50*3+2*3 =50*V+2*10 V=136/50 V=2.72 m s^-1"
    },
    {
        "number": 222,
        "text": "Which scenario best demonstrates Newton's First Law of Motion?",
        "options": {
            "A": "A moving car suddenly brakes, causing passengers to lean forward.",
            "B": "A stationary box starts moving when pushed.",
            "C": "A rocket accelerates upward by expelling gas.",
            "D": "An object slides at constant velocity on a frictionless horizontal surface."
        },
        "correct_answer": "D",
        "explanation": "Newton's First Law states that an object with no net force acting on it will maintain constant velocity (including rest). Option D satisfies this condition. A demonstrates inertia but does not directly describe the law; B and C involve forces changing motion (Second/Third Laws)."
    },
    {
        "number": 223,
        "text": "A 2 kg object accelerates at \\( 3 \\, \\text{m/s}^2 \\). What is the net force acting on it?",
        "options": {
            "A": "1.5N",
            "B": "6N",
            "C": "5N",
            "D": "0.67N"
        },
        "correct_answer": "B",
        "explanation": "By Newton's Second Law: F = ma = 2kg * 3m/s^2 = 6N."
    },
    {
        "number": 224,
        "text": "Which statement about momentum is correct?",
        "options": {
            "A": "Momentum is a scalar.",
            "B": "Momentum conservation applies only to elastic collisions.",
            "C": "If an object’s velocity doubles, its momentum doubles.",
            "D": "Momentum direction aligns with acceleration direction."
        },
        "correct_answer": "C",
        "explanation": "Momentum p = mv. Doubling velocity doubles momentum (C correct). A is false (momentum is a vector); B is false (conserved in all isolated systems); D is false (momentum aligns with velocity, not acceleration)."
    },
    {
        "number": 225,
        "text": "A 5 kg box is pushed 10 m horizontally with an applied force of 20 N against 5 N friction. What is the work done by the applied force?",
        "options": {
            "A": "100 J",
            "B": "200 J",
            "C": "50 J",
            "D": "150 J"
        },
        "correct_answer": "B",
        "explanation": "Work done by the applied force: W = Fd = 20N * 10m= 200J."
    },
    {
        "number": 226,
        "text": "A stone falls freely from 20 m height (air resistance neglected). What is its speed upon impact?",
        "options": {
            "A": "10 m/s",
            "B": "19.8 m/s",
            "C": "30 m/s",
            "D": "40 m/s"
        },
        "correct_answer": "B",
        "explanation": "Using energy conservation: v^2 = u^2 + 2as v^2 = 2 * 9.81 * 20 v = 19.8ms^-1"
    },
    {
        "number": 227,
        "text": "A 0.5 kg ball hits a wall at 10 m/s and rebounds at 8 m/s. What is its momentum change?",
        "options": {
            "A": "1 kg·m/s",
            "B": "9 kg·m/s",
            "C": "18 kg·m/s",
            "D": "-9 kg·m/s"
        },
        "correct_answer": "B",
        "explanation": "Momentum change: p = m(v - u) p = 0.5(-8 - 10) p = -9kg m/s."
    },
    {
        "number": 228,
        "text": "A car travels at a constant 60 km/h. Which statement is true?",
        "options": {
            "A": "Engine force > friction.",
            "B": "Engine force = friction.",
            "C": "Engine force < friction.",
            "D": "The car has negative acceleration."
        },
        "correct_answer": "B",
        "explanation": "Constant velocity implies zero net force. The engine force balances friction."
    },
    {
        "number": 229,
        "text": "According to Boyle’s Law, if a gas is compressed from 4 m³ to 2 m³ in constant temperature, how does its pressure change?*",
        "options": {
            "A": "Halved",
            "B": "Doubled",
            "C": "Unchanged",
            "D": "Quadrupled"
        },
        "correct_answer": "B",
        "explanation": "Boyle’s Law states  P_1 V_1 = P_2 V_2. Halving the volume doubles the pressure."
    },
    {
        "number": 230,
        "text": "A gas in a rigid container has an initial pressure of 100 kPa at 20°C. If the temperature rises to 40°C, what is the new pressure?",
        "options": {
            "A": "93.3 kPa",
            "B": "106.8 kPa",
            "C": "100 kPa",
            "D": "200 kPa"
        },
        "correct_answer": "B",
        "explanation": "Using Charles’s Law P_1 / T_1 =P_2 / T_2 P_2 = P_1 * T_2 / T_1 P_2 = 100kPa * 313 \\ 293 P_2  = 106.8kPa."
    },
    {
        "number": 231,
        "text": "A balloon’s gas has a pressure of 200 kPa. If its volume expands to 4× the original in constant temperature, what is the new pressure?",
        "options": {
            "A": "50 kPa",
            "B": "200 kPa",
            "C": "800 kPa",
            "D": "1600 kPa"
        },
        "correct_answer": "A",
        "explanation": "By Boyle’s Law: P_2 = P_1 * V_1 / V_2 P_2 = 200 * V / 4V P_2 = 50kPa"
    },
    {
        "number": 232,
        "text": "Match each observation (1–3) to the correct gas law (A–C): 1.When cooled, the gas volume decreases at constant pressure. 2.When heated, the gas pressure increases at constant volume. 3.When compressed, the gas pressure increases at constant temperature.",
        "options": {
            "A": "1:a  2:b  3:c",
            "B": "1:b  2:c  3:a",
            "C": "1:c  2:a  3:b",
            "D": "1:b  2:a  3:c"
        },
        "correct_answer": "B",
        "explanation": "1. Volume decreases when cooled (constant P) 2.Pressure increases when heated (constant V) 3.Pressure increases when compressed (constant T)"
    },
    {
        "number": 233,
        "text": "According to Newton’s law of motion, if a stone in space is thrown out at the velocity of 20 ms^-1, what is its speed when 1000 thousand years have passed?",
        "options": {
            "A": "0 m/min",
            "B": ".2 km/s",
            "C": "000 km/s",
            "D": "2 km/h"
        },
        "correct_answer": "",
        "explanation": "Anyone who gets this question wrong has not attended a single lesson."
    },
    {
        "number": 234,
        "text": "Crane A is lifting a 10 kg load by 10m with constant velocity. What is the gain in potential energy?",
        "options": {
            "A": "00J",
            "B": "81J",
            "C": ".81J/s",
            "D": "81W"
        },
        "correct_answer": "",
        "explanation": "gain in P.E.= (change in height)*(acceleration due to gravity)*(mass)"
    },
    {
        "number": 235,
        "text": "Crane B lifted the same load along a frictionless slope in the same amount of time with constant velocity. Which of the following is correct?",
        "options": {
            "A": "rane B does more work than Crane A",
            "B": "rane A has a higher power than Crane B",
            "C": "he distance travelled by the load lifted by Crane B is longer than that lifted by Crane A",
            "D": "he vertical displacement travelled by the load lifted by Crane B is longer than that lifted by Crane A"
        },
        "correct_answer": "",
        "explanation": "By pythagoras' theorem, the length of the hypotenuse must be longer than the other two sides."
    },
    {
        "number": 236,
        "text": "What if the slope is not frictionless? Which of the following is correct?",
        "options": {
            "A": "rane B does more work than Crane A",
            "B": "rane A has a higher power than Crane B",
            "C": "he work done against friction by Crane B is the same as the gain in potential energy by the load",
            "D": "he vertical displacement travelled by the load lifted by Crane B is longer than that lifted by Crane A"
        },
        "correct_answer": "A",
        "explanation": "A larger force is needed to overcome the friction. So with a large force by W=fs, given the same s, W is larger."
    },
    {
        "number": 237,
        "text": "Which of the following regarding the kinetic gas theory and general gas law is correct?",
        "options": {
            "A": "hen the volume of the container decreases, the gas molecules collide with the walls of the container more violently",
            "B": "he total kinetic energy of the particles must increase when the temperature increases even when other factors are also changed.",
            "C": "he momentum change of the gas particles when they collide with the walls of the container explains gas pressure",
            "D": "he general gas law can accurately describe nitrogen gas at -196˚C"
        },
        "correct_answer": "C",
        "explanation": "Pressure=Force/Area Force is required to cause change of momentum. So the change in momentum of the gas particles when colliding with the walls of the container creates gas pressure"
    },
    {
        "number": 238,
        "text": "A block slides down from a slope 10 m high and hits another block of the same mass at the end of the slope. The collision is completely inelastic. The blocks travel up another slope of the height of 2m. What is the loss of energy? Express the answer in terms of m, the mass of one block.",
        "options": {
            "A": "0m",
            "B": "9.9m",
            "C": "8.48m",
            "D": "8.86m"
        },
        "correct_answer": "",
        "explanation": "P.E. at the start- P.E. at the end"
    },
    {
        "number": 239,
        "text": "Which of the following is correct?",
        "options": {
            "A": "he mass of the block in a lift decelerating downwards decreases",
            "B": "he apparent weight of the block in a lift accelerating upwards increases",
            "C": "he apparent weight of the bock in a lift decelerating upwards increases",
            "D": "he mass of the block in a lift moving at constant velocity decreases"
        },
        "correct_answer": "B",
        "explanation": "Apparent weight is the normal reaction force exerted by the floor on the person. When the lift is accelerating upwards, the man is also accelerating upwards so an upward force provided by the floor is needed."
    },
    {
        "number": 240,
        "text": "A space battleship fires a cannon ball of 10 kg with its railgun pointing forward at a velocity of 11.2 km/s. What is the exhaust velocity of gas ejected out of the thrusters at the back in order to keep the space battleship stationary if the mass of gas ejected is 1.34 kg?",
        "options": {
            "A": "35 km/s",
            "B": "8360 m/s",
            "C": "3.6 m/s",
            "D": "3.6 km/s"
        },
        "correct_answer": "D",
        "explanation": "v= 11.2*1000*10/1.34 m/s"
    },
    {
        "number": 241,
        "text": "Freedom Gundam fires its thrusters for 1 second to evade a missile from the enemy. When it fires its thrusters, the body of it is perpendicular to horizontal. The thruster at its back makes a 30˚ angle to its body. The mass of Freedom Gundam is 71500 kg and 5 kg of gas is ejected out of the engine at 20 km/s. What is the change in vertical velocity? Assume it is not affected by any gravitational fields.",
        "options": {
            "A": ".4 m/s",
            "B": ".699 m/s",
            "C": ".21 m/s",
            "D": "60 m/s"
        },
        "correct_answer": "C",
        "explanation": "∆V = ((20000*5)/71500)*cos30˚"
    },
    {
        "number": 242,
        "text": "a driver driving at 30m/s on a straight path and he sees a stone 100 m in front of him. To avoid crushing his car, he needs to stop in front of the stone. To note that there is a reaction time of the driver. He stopped his car in front of the stone in 6s after his car started decelerating. What is the magnitude of deceleration of the car and the reaction time respectively?",
        "options": {
            "A": "m/s²,0.66s",
            "B": "m/s²,0.33s",
            "C": "0m/s²,0.66s",
            "D": "0m/s²,0.33s"
        },
        "correct_answer": "",
        "explanation": "From the question,we can know that initial velocity=30m/s,time=6s,final velocity=0. By v=u+at, we can know that the deceleration=5m/s². By v²=u²+2as, we can know that the distance traveled after starting deceleration is 90m. 100-90=10m is the distance traveled in reaction time. 10/30=0.33s"
    },
    {
        "number": 243,
        "text": "Two balls X and Y are 3 kg and 5 kg respectively.  X is moving toward the right to Y with a velocity of 5m/s when Y is remaining at rest. When X and Y collide, Y move towards the right with a velocity of 4m/s. Assume 2 balls are moving on a smooth surface and the total momentum is conserved, what is the velocity of X after colliding?",
        "options": {
            "A": ".67m/s(rightwards)",
            "B": "m/s(rightwards)",
            "C": ".67m/s(leftwards)",
            "D": "m/s(leftwards)"
        },
        "correct_answer": "",
        "explanation": "According to p=mv and conservation of total momentum, 3(5)+5(0)=5(4)+3v         v=-1.67m/s"
    },
    {
        "number": 244,
        "text": "a 5N pushing force is acted on a 2kg block and the block is moving rightward. Assume the block is moving on a smooth surface and there is no other force acting on it. What is the acceleration of the block?",
        "options": {
            "A": ".5m/s²(leftward)",
            "B": "m/s²(rightward)",
            "C": ".5m/s²(rightward)",
            "D": "m/s²(leftward)"
        },
        "correct_answer": "",
        "explanation": "By Fnet=ma, 5=2a,a=2.5. The block is moving rightward and so it gets a 2.5m/s²(rightward) acceleration but not 3m/s² or leftward acceleration."
    },
    {
        "number": 245,
        "text": "Identical blocks X and Y are connected by a string, block X is on the left of block Y and they are placed on a smooth surface. Block X is pulled towards left by a 6N force horizontally while Block Y is pulled towards right by a 10N force horizontally . The string is inextensible. Find the magnitude of the net force acting on block X and Y respectively by considering the system of objects.",
        "options": {
            "A": "an’t determine when mass is not given.",
            "B": "N,3N",
            "C": "N,1N",
            "D": "N,2N"
        },
        "correct_answer": "",
        "explanation": "we can find the net force by using Fnet=ma even if the mass is not given. Let the mass of X and Y be m kg. By considering the system of objects, 10-6=2ma a=2/m. Net force of Y=2/m·m=2N   Net force of X=2/m·m=2N"
    },
    {
        "number": 246,
        "text": "Which of the following can be a unit of work? kgm²/s² J/s J m",
        "options": {
            "A": "1),(4)",
            "B": "1),(3)",
            "C": "2),(3)",
            "D": "ll of the above"
        },
        "correct_answer": "",
        "explanation": "Work done=F·displacement The unit of work is Nm or J By considering Fnet=ma Nm can also express in kgm²/s²"
    },
    {
        "number": 247,
        "text": "Wil and Jeremy are running on the playground. The mass of Jeremy is wil’s times 1.5 and they have the same KE. What is the ratio of the speed of wil to Jeremy?",
        "options": {
            "A": ":√1.5",
            "B": ":1.5",
            "C": ".5:1",
            "D": "1.5:1"
        },
        "correct_answer": "",
        "explanation": "Let wil’s weight be m kg,Jeremy’s be 1.5m kg 0.5mv²=0.5·1.5mu²         v²=1.5u²          v:u=√1.5:1"
    },
    {
        "number": 248,
        "text": "An athlete of mass 65 kg jumps on a trampoline.  A, The lowest position she reached where the trampoline is fully stretched is 30 cm lower than B,  the position when the trampoline is not stretched and her speed upward is 3.5m/s. Find the elastic PE stored in the trampoline when she is at A. Assume the total mechanical energy are conserved.",
        "options": {
            "A": "88J",
            "B": "89J",
            "C": "90J",
            "D": "91J"
        },
        "correct_answer": "",
        "explanation": "when she is at A, the elastic PE is at max, GPE=0,KE=0. When she is at B the elastic PE=0, GPE=65·9.81·0.3, KE= 0.5·65·3.5² Total mechanical energy is conserved, elastic PE at A=65·9.81·0.3+0.5·65·3.5²=589.42》589J"
    },
    {
        "number": 249,
        "text": "A box of mass 15 kg is acted on by a force of 70N. The box is moving with a constant velocity of 5m/s on a rough horizontal surface. If all the applied force suddenly disappeared, what would be the magnitude of the net force on the box?",
        "options": {
            "A": "N",
            "B": "5N",
            "C": "0N",
            "D": "5N"
        },
        "correct_answer": "",
        "explanation": "The box is moving with a constant velocity on a rough surface, which means that Fnet=0, friction applied on the box=70N. When applied force of 70N disappeared , in that instant friction of 70N is acting on the box, so the net force of the box is 70N at that instant."
    },
    {
        "number": 250,
        "text": "The pressure of a fixed volume of an ideal gas is 150kpa and its temperature is 30°C. The gas is then heated to 50°C, what will be the new pressure of the gas?",
        "options": {
            "A": "00kpa",
            "B": "50kpa",
            "C": "59kpa",
            "D": "60kpa"
        },
        "correct_answer": "",
        "explanation": "since P/T=constant,150/(30+273)=p/(50+273) p=159.9》160kpa"
    },
    {
        "number": 251,
        "text": "A van of mass 1000kg decelerates uniformly from 40ms^[-1] to stop in 50m along a horizontal road. Find the friction acting on the car.",
        "options": {
            "A": "000N",
            "B": "0000N",
            "C": "6000N",
            "D": "0000N"
        },
        "correct_answer": "C",
        "explanation": "KE1 +PE1 =KE2+PE2+Workdone by friction ½ 1000*40^[2]=50f F=16000N"
    },
    {
        "number": 252,
        "text": "On a smooth surface, ball A and ball B collide. A of 100g moves at 3ms^[-1] towards right and B of 50g moves at 5ms ^[-1] both just right before collision.Which of the following is/are the possible results . 1)A stops 2)B stops 3)Both moves at 0.33 ms^[-1] towards the right after collision",
        "options": {
            "A": "only",
            "B": ",2 only",
            "C": "only",
            "D": ",2,3"
        },
        "correct_answer": "C",
        "explanation": "Initial momentum: Take rightwards as positive (0.1*3)+(0.05*-5)=0.05kg m/s As it is an inelastic collision,if both balls were to stop completely after the collision, the total final momentum would be zero. Since momentum is conserved, if the initial momentum is not zero, the final momentum cannot be zero.And none of the ball will stop because the final velocity is not zero. 0.05=(0.1+0.05)v V=0.33m/s (rightwards) Only 3 is correct"
    },
    {
        "number": 253,
        "text": "Water enters and leaves the hose at the same speed 5ms and 800g water flows out of hose each second. The child bends the hose so that he could pour the water into the pool. The water flows from the ground to the pool with the hose rolled up for few times. Which of the following statements is true.",
        "options": {
            "A": "he momentum of water is conserved.",
            "B": "he momentum of water is changed.",
            "C": "here is no net force acting on the water",
            "D": "here is no force acting on the hose."
        },
        "correct_answer": "B",
        "explanation": "because the direction of velocity of water has changed Net force acting on water is equal to the rate of change in momentum of water.There is change in momentum of water, there is net force. There is force acting on the hose , by Newton third law,as the hose exert force on water, water exert a force on hose too."
    },
    {
        "number": 254,
        "text": "Two containers containing the same ideal gas, Container A is 50m^[3] ,container B is 10m^[3]. They are connected by a tube with a tap closed initially. Which of the following quantity will become the same after opening the tap? The number of moles of gas in each container The number molecules of gas in each container The air pressure in each container",
        "options": {
            "A": "only",
            "B": "and 3",
            "C": "and 3",
            "D": "only"
        },
        "correct_answer": "",
        "explanation": "The gas will redistribute  based on the volume of containers, so neither the number of moles nor the molecules will become the same.However after opening the tap, the pressure in each container will be equalized."
    },
    {
        "number": 255,
        "text": "A man stands on a weighing scale inside a lift. The scale reads 690 N. What will the scale read if the lift accelerates upwards at 3ms^[-1] ?",
        "options": {
            "A": "50N",
            "B": "10N",
            "C": "02N",
            "D": "54N"
        },
        "correct_answer": "",
        "explanation": "690/9.81 =70.336 kg Fnet=ma W=70.4*(9.81+3) W=901.8N"
    },
    {
        "number": 256,
        "text": "Match each observation (1–3) to the correct gas law (A–C): 1.When temperature decreased, the gas volume decreases at constant pressure. 2.When compressed, the gas pressure increases at constant temperature. 3.When heated, the gas pressure increases at constant volume.",
        "options": {
            "A": "1:a  2:b  3:c",
            "B": "Charles’ Law",
            "C": "Pressure Law",
            "D": ""
        },
        "correct_answer": "D",
        "explanation": "1. Volume decreases when cooled (constant P) 2.Pressure increases when compressed (constant T) 3.Pressure increases when heated (constant V)"
    },
    {
        "number": 257,
        "text": "A cylinder contains an ideal gas at 27°c with a pressure of 200 kPa. If the temperature rises to 150 °c while the volume remains constant, what is the new pressure of the gas?",
        "options": {
            "A": "182 kPa",
            "B": "234 kPa",
            "C": "282 kPa",
            "D": "316 kPa"
        },
        "correct_answer": "C",
        "explanation": ": 200/(273+27)=  P/ (273+150)"
    },
    {
        "number": 258,
        "text": "A beam with length of 6m , self weight if 2kg  is balanced at its pivot. A 3 kg mass is placed 1 meter to the left of the pivot. What mass must be placed 3 meters to the right of the pivot to keep the beam in equilibrium?",
        "options": {
            "A": "kg",
            "B": "kg",
            "C": ".5kg",
            "D": "kg"
        },
        "correct_answer": "",
        "explanation": "Total Momentclockwise=Moment Beam+Moment left=58.86+29.43=88.29(nm) Moment right​=m×9.81×3=29.43m(nm) Anticlockwise =clockwise 88.29/29.43=m M=3 kg"
    },
    {
        "number": 259,
        "text": "A rubber ball is thrown to the ground and bounces . Which of the following statements is/are correct?",
        "options": {
            "A": "The momentum of the ball is conserved.",
            "B": "The total momentum of the ball and the wall is conserved.",
            "C": "The momentum of the wall is conserved.",
            "D": "None of the above."
        },
        "correct_answer": "B",
        "explanation": "B:Momentum is always conserved in a system . There is no extra external energy act on"
    },
    {
        "number": 260,
        "text": "Which of the following statements are incorrect",
        "options": {
            "A": "ressure is directly proportional to Volume",
            "B": "ressure is directly proportional to Temperature",
            "C": "olume is directly proportional to Temperature",
            "D": "ressure x Volume is directly proportional to Temperature"
        },
        "correct_answer": "",
        "explanation": "it is because pressure against the volume is a curve plotted on the graph."
    },
    {
        "number": 261,
        "text": "What is not a definition of an ideal gas?",
        "options": {
            "A": "ll the molecules are identical and have the same mass.",
            "B": "ntermolecular forces are negligible",
            "C": "he size of each molecule is negligible compared with the separation between them.",
            "D": "ll the molecules are in continuous regular motion."
        },
        "correct_answer": "",
        "explanation": "It is because all the molecules should be in continuous random motion for ideal gas."
    },
    {
        "number": 262,
        "text": "Mr. Hung finds out that the meat balls get BIGGER when he puts them in the hotpot. Suppose the meatball at 0 degree can trap 1cm3 of air and no air is leaked when heated. Besides, the pressure is also unchanged.What is the volume of the air when it is heated to 100degree.",
        "options": {
            "A": ".29cm3",
            "B": ".37cm3",
            "C": ".42cm3",
            "D": ".48cm3"
        },
        "correct_answer": "",
        "explanation": "By using Charles's Law, which states that the volume of a gas is directly proportional to its temperature when pressure is held constant,we can find the V1/T1 =V2/T2"
    },
    {
        "number": 263,
        "text": "Which scenario demonstrates the concept of work done on an object?",
        "options": {
            "A": "ushing an extreme heavy object on rough surface",
            "B": "olding a box stationary",
            "C": "ushing a box on a frictionless surface",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "Work is the energy transferred due to the action of force over a displacement, as in lifting or pushing the box. Holding the box stationary (B) or (A) involves no displacement, so no work is done."
    },
    {
        "number": 264,
        "text": "If two objects collide elastically, which of the following statements is true?",
        "options": {
            "A": "inetic energy is lost",
            "B": "nly momentum is conserved",
            "C": "otal momentum before collision equals total momentum after collision",
            "D": "otential energy is converted to kinetic energy"
        },
        "correct_answer": "C",
        "explanation": "In elastic collisions, both momentum and kinetic energy are conserved. A is incorrect because kinetic energy is not lost; B is wrong as kinetic energy is also conserved, and D misrepresents energy conversion in elastic collisions."
    },
    {
        "number": 265,
        "text": "When an explosion occurs, 2 objects with different directions and masses fly away. In this situation,which of the following sum is 0?",
        "options": {
            "A": "omentum",
            "B": "elocity",
            "C": "inetic energy",
            "D": "one of the above"
        },
        "correct_answer": "",
        "explanation": "During explosion only momentum is conserved and at the beginning  the momentum is 0, showing that after explosion the momentum is also 0."
    },
    {
        "number": 266,
        "text": "In an inelastic collision, what happens to the momentum of the system?",
        "options": {
            "A": "It is conserved",
            "B": "It increases",
            "C": "t decreases",
            "D": "t transforms into potential energy"
        },
        "correct_answer": "",
        "explanation": "In inelastic collisions,momentum is transferred also. B and C are incorrect as momentum will not be lost and D misrepresents energy transformation."
    },
    {
        "number": 267,
        "text": "In an isolated system, what MUST BE TRUE about the total energy?",
        "options": {
            "A": "t can change forms but remains constant",
            "B": "It can be created or destroyed",
            "C": "t is always increasing",
            "D": "t is dependent on external forces"
        },
        "correct_answer": "",
        "explanation": "The law of conservation of energy states that energy cannot be created or destroyed but can transform from one form to another. B is incorrect as energy cannot be created or destroyed; C is wrong because total energy does not inherently increase, and D is incorrect as external forces do not affect total energy in an isolated system."
    },
    {
        "number": 268,
        "text": "A sample of gas occupies a volume of 1.47m3 at a pressure of 200 kPa and a temperature of 25 degree. What is the total KE of the gas molecules?",
        "options": {
            "A": "67000J",
            "B": "89000J",
            "C": "13000J",
            "D": "41000J"
        },
        "correct_answer": "",
        "explanation": "Using The gas law we find the no. of mole is 118.72with n=PV/RT and use second law KE=3/2nRT getting 441000J"
    },
    {
        "number": 269,
        "text": "Trolley A accelerates to right and crashes on Trolly B which has a constant velocity to right. They then stick together and move to the right with the same speed. What kind of collision is it?",
        "options": {
            "A": "ompletely inelastic collision",
            "B": "nelastic collision",
            "C": "lastic collision",
            "D": "xplosion"
        },
        "correct_answer": "B",
        "explanation": "they have the same direction ."
    },
    {
        "number": 270,
        "text": "which is/are the equation(s) of the total kinetic energy of a gas? 1)1/2Nmc2 2) 3/2 PV 3) 3/2 nRT",
        "options": {
            "A": ",3",
            "B": ",2",
            "C": ",3",
            "D": ",2,3"
        },
        "correct_answer": "",
        "explanation": "total kinetic energy =3/2nRT= 1/2Nmc2, and PV=nRT so 2 is also correct"
    },
    {
        "number": 271,
        "text": "The pressure and temperature of a gas is 110 kpa and 2C respectively. When it is heated, the temperature becomes 7C while the pressure do not change. What does the volume change?",
        "options": {
            "A": "ncrease",
            "B": "ecrease",
            "C": "nchanged",
            "D": "an not be determined"
        },
        "correct_answer": "",
        "explanation": "PV/T= constant. When T increases, V increases."
    },
    {
        "number": 272,
        "text": "when pressure of a gas decreases, which of the following is incorrect? 1.Total kinetic energy conserved 2.R increases constantly 3.temperature decreases",
        "options": {
            "A": ",2",
            "B": ",3",
            "C": ",3",
            "D": ",2,3"
        },
        "correct_answer": "",
        "explanation": "KE increases, while R is a constant. Temperature will decrease."
    },
    {
        "number": 273,
        "text": "There is a hot air balloon. It has a fixed volume of 500m3. The temperature before and after it rises are 25C and 60C respectively. The pressure before and after it rises are 50kPa and 46kPa respectively. Find the number of molecules before and after it rises.",
        "options": {
            "A": "075;0 moles",
            "B": "0095;2330 moles",
            "C": "075;2730 moles",
            "D": "0095;8312 moles"
        },
        "correct_answer": "D",
        "explanation": "PV= nRT (500)(50000)=n8.31(298) (500)(46000)=n(8.31)(333)"
    },
    {
        "number": 274,
        "text": "A car weighted 500N travelling with a speed of 20m/s on a highway and crashed to a bus weighted 1000N that was stopped beside the road.Neglecting the friction of the bus then moved 10 metres after a second, what is the velocity when the car hit the bus?",
        "options": {
            "A": "m/s",
            "B": "0m/s",
            "C": ".67m/s",
            "D": "m/s"
        },
        "correct_answer": "",
        "explanation": "Conservation of momentum"
    },
    {
        "number": 275,
        "text": "A car was travelling at 10m/s, the driver saw a dog on the road and applied the brake with in 0.394s, the car finally came to a stop after 10s, what is the acceleration of the car?",
        "options": {
            "A": "",
            "B": "2",
            "C": "9.27",
            "D": ".27"
        },
        "correct_answer": "",
        "explanation": "reaction time is included in the total time"
    },
    {
        "number": 276,
        "text": "Which of the following processes release latent heat?",
        "options": {
            "A": "melting",
            "B": "vaporization",
            "C": "solidification",
            "D": "boiling"
        },
        "correct_answer": "C",
        "explanation": "the question ask for releases latent heat , so the answer not A, B, and D"
    },
    {
        "number": 277,
        "text": "A sealed container holds a gas at 300K. If the gas is heated so that its pressure increases from 60kPa to 180kPa, what is its final temperature? Assume the volume of the gas is fixed.",
        "options": {
            "A": "36K",
            "B": "100K",
            "C": "627K",
            "D": "900K"
        },
        "correct_answer": "",
        "explanation": "60/300=180/T T=900K"
    },
    {
        "number": 278,
        "text": "A sealed syringe is filled with 30cm3 of air at a temperature of 29°C. The syringe is cooled to 4°C in a freezer. What is the new volume of the air? Assume the air pressure inside the syringe remains constant.",
        "options": {
            "A": "4.14cm3",
            "B": "27.5cm3",
            "C": "3.87cm3",
            "D": "287cm3"
        },
        "correct_answer": "B",
        "explanation": "30/(29+273)=V/(4+273) V=27.5cm3"
    },
    {
        "number": 279,
        "text": "A sealed syringe contains 80cm3 of air at a temperature of 27°C and a pressure of 100kPa. When the piston is quickly pushed inwards to reduce the volume to 70cm3, the temperature rises to 33°C.  What is the new pressure?",
        "options": {
            "A": "117kPa",
            "B": "81.6kPa",
            "C": "207kPa",
            "D": "140kPa"
        },
        "correct_answer": "A",
        "explanation": "100(80)/(27+273)=P(70)/(33+273) P=117kPa"
    },
    {
        "number": 280,
        "text": "A sealed can of volume 350cm3 contains an ideal gas at 115kPa and 20°C. What is the number of moles of gas in the can? Take R to be 8.31 J mol-1 K-1.",
        "options": {
            "A": "16.5 mol",
            "B": "0.0165 mol",
            "C": "0.0177*10 ^-3 mol",
            "D": "0.0177 mol"
        },
        "correct_answer": "B",
        "explanation": "pV=nRT n=pV/RT=(115*10^3)(350*10^-6)/8.31(20+273) n=0.0165 mol"
    },
    {
        "number": 281,
        "text": "A man is pushing a car but the car does not move. If the pushing force on the car by the man is the action force, what is the reaction force?",
        "options": {
            "A": "the force acting on the man by the ground",
            "B": "the force acting on the ground by the man",
            "C": "the force acting on the man by the car",
            "D": "the force acting on the car by the man"
        },
        "correct_answer": "C",
        "explanation": "the pushing force on the car by the man, so the answer is not A or B. Every action is an equal and opposite reaction, so the answer is C."
    },
    {
        "number": 282,
        "text": "The masses of blocks A and B are 6 kg and 4 kg respectively. They are connected by a string on the smooth horizontal plane. If A is pulled by a horizontal force of 20 N and the two blocks move to the right together, what is the tension in the string?",
        "options": {
            "A": "6N",
            "B": "12N",
            "C": "24N",
            "D": "30N"
        },
        "correct_answer": "B",
        "explanation": "Fnet = ma\t\t\t\t\tT=6*2 a=2m s^-2\t\t\t\tT=12N"
    },
    {
        "number": 283,
        "text": "A puppy pulls a towel and remains stationary on the ground. The towel makes an angle of 30° to the horizontal and the tension in it is 10N. Find the friction acting on the puppy by the ground?",
        "options": {
            "A": "5N",
            "B": "8.66N",
            "C": "5.21N",
            "D": "29.5N"
        },
        "correct_answer": "B",
        "explanation": "10 cos 30° =8.66 N"
    },
    {
        "number": 284,
        "text": "A spaceship of mass 120 kg flies forwards in outer space. Its rocket is fired to speed up the spaceship from 50 m s^-1 to 60 m s^-1 in 20 s. Assume that the power provided by the rocket is constant and the resistive force acting on the spaceship is negligible. Find the power of the rocket.",
        "options": {
            "A": "33 W",
            "B": "330 W",
            "C": "3300 W",
            "D": "3.3*10^4 W"
        },
        "correct_answer": "C",
        "explanation": "½ mu^2+Pt=½ mv^2 P=½ *120*(60^2-50^2)/20 P=3300W"
    },
    {
        "number": 285,
        "text": "Jason of mass 50 kg holds a 2 kg ball and skates forwards at 3 m s^-1 . Then he throws the ball so that it moves forwards at 10 m s^-1. What is his velocity after throwing the ball?",
        "options": {
            "A": "1.61 m s^-1",
            "B": "2.04 m s^-1",
            "C": "2.72 m s^-1",
            "D": "4.39 m s^-1"
        },
        "correct_answer": "C",
        "explanation": "50*3+2*3 =50*V+2*10 V=136/50 V=2.72 m s^-1"
    }
]
